{
    "subreddits": {
        "stocks": {
            "count": 10,
            "posts": [
                {
                    "id": "1nnnij5",
                    "url": "https://www.reddit.com/r/stocks/comments/1nnnij5/tsla_bulls_are_celebrating_rn/",
                    "score": 526,
                    "title": "TSLA bulls are celebrating rn.",
                    "author": "AltruisticDBS",
                    "comments": [
                        {
                            "id": "nfltb4u",
                            "body": "As Charlie Munger said, I would never buy it but I would never bet against it.",
                            "score": 172,
                            "author": "RogueSwoobat",
                            "created_utc": 1758551694,
                            "replies_count": 2
                        },
                        {
                            "id": "nflpwzo",
                            "body": "If the stock market was rational and predictable, everyone would be a billionaire. There’s wealthy people out there playing their own games.",
                            "score": 436,
                            "author": "Zylavier",
                            "created_utc": 1758550681,
                            "replies_count": 2
                        },
                        {
                            "id": "nflp3wo",
                            "body": "Sheesh, you don't want to invest in magic beans? What's wrong with you. They are magic, dude. These aren't regular beans, they are magic beans.",
                            "score": 232,
                            "author": "luv2block",
                            "created_utc": 1758550438,
                            "replies_count": 2
                        },
                        {
                            "id": "nflqvca",
                            "body": "Where have I heard this before.....",
                            "score": 38,
                            "author": "JackfruitCrazy51",
                            "created_utc": 1758550965,
                            "replies_count": 0
                        },
                        {
                            "id": "nfm23nt",
                            "body": "It's part of the inverse reddit index. The more reddit gets it's feelings hurt, the higher it goes.",
                            "score": 46,
                            "author": "DannyMeatlegs",
                            "created_utc": 1758554259,
                            "replies_count": 1
                        },
                        {
                            "id": "nflp5jx",
                            "body": "I'm baffled.\nIts going up from 2030 estimates going up. Any dcf shows over valuation unless you use 2030 optimistic numbers. ",
                            "score": 62,
                            "author": "stiveooo",
                            "created_utc": 1758550451,
                            "replies_count": 1
                        },
                        {
                            "id": "nflrp9a",
                            "body": "Been telling people for a long time not to short meme stocks. They’ll rip your face off more times than not.",
                            "score": 58,
                            "author": "jason082",
                            "created_utc": 1758551215,
                            "replies_count": 1
                        }
                    ],
                    "selftext": "ATHs of 488 to be hit this week. Absolute no reason for this pump but it is how it is. The more people hate him, the higher it will just go. Likely to see another repeat of last year where the stock shot up in the last quarter of the year.\n\nStock is just insane. Classic example of irrational behaviour.",
                    "permalink": "https://reddit.com/r/stocks/comments/1nnnij5/tsla_bulls_are_celebrating_rn/",
                    "subreddit": "stocks",
                    "created_utc": 1758550198,
                    "sort_method": "hot",
                    "num_comments": 341
                },
                {
                    "id": "1npkzqd",
                    "url": "https://www.reddit.com/r/stocks/comments/1npkzqd/valuedividend_stock_reccomendations/",
                    "score": 14,
                    "title": "Value/Dividend Stock Reccomendations?",
                    "author": "Solid_Scar9055",
                    "comments": [
                        {
                            "id": "ng0mao3",
                            "body": "ET..  Natural gas play to power data centers and the regular grid.. Energy Transfer (ET.NaE) has outperformed the market over the past 5 years by 10.36% on an annualized basis producing an average annual return of 25.56%. Currently, Energy Transfer (ET.NaE) has a market capitalization of $58.87 billion.",
                            "score": 5,
                            "author": "jigmaster500",
                            "created_utc": 1758747993,
                            "replies_count": 0
                        },
                        {
                            "id": "nfzyboo",
                            "body": "ABBV and CMI have been very good to me (and put money in my pocket)",
                            "score": 3,
                            "author": "jeffrey_jehosaphat",
                            "created_utc": 1758740954,
                            "replies_count": 0
                        },
                        {
                            "id": "ng8avwz",
                            "body": "CTRE- senior care real estate has been making me a fortune. I am also expecting another dividend increase soon.\n\nARCC- The biggest, best BDC in the business. Turn on the Drip and enjoy the ride.\n\nI also have a unicorn pick. These come around every once in a while and usually you can count the number of unicorns on one hand. The last unicorn pick turned out to be a ten-bagger Rolls Royce (RYCEY.).We got in at the $1-$2 range. Unicorns create life changing money.\n\nAs of right now I found 1 unicorn out of 23,281 stocks. I won’t bury the lead. APA is an oil and gas play that has cash flow coming in the doors. Just as important nobody is talking about which is exactly where I like to be. I do suggest using a 25% trailing stop to protect your principal.",
                            "score": 3,
                            "author": "Revfunky",
                            "created_utc": 1758849581,
                            "replies_count": 0
                        },
                        {
                            "id": "ng0olw7",
                            "body": "NVO and UNH for sure, maybe ELV, all undervalued at the moment",
                            "score": 3,
                            "author": "Aniriomellad",
                            "created_utc": 1758748708,
                            "replies_count": 0
                        },
                        {
                            "id": "ng14gyr",
                            "body": "Utilities (e.g. ED) are stable. A few (e.g. CEG) are pumped up a bit from AI wanting all our electricity but overall the sector is not frothy and pays reasonable and stable dividends.",
                            "score": 2,
                            "author": "draw2discard2",
                            "created_utc": 1758753939,
                            "replies_count": 0
                        },
                        {
                            "id": "ng16qxo",
                            "body": "all my money is basically in 7 stocks and second place is PM, who just raised their already huge dividend. dont think they're going anywhere, and will definitely be more stable than the stuff you mentioned.",
                            "score": 2,
                            "author": "ryallen23",
                            "created_utc": 1758754739,
                            "replies_count": 1
                        },
                        {
                            "id": "ng1esh5",
                            "body": "Because you said dividends: BST, LYB, PFE, TGT, VZ",
                            "score": 2,
                            "author": "MorrisseysRubiksCube",
                            "created_utc": 1758757552,
                            "replies_count": 0
                        },
                        {
                            "id": "ng28vyn",
                            "body": "Schd",
                            "score": 2,
                            "author": "johnmiddle",
                            "created_utc": 1758768405,
                            "replies_count": 0
                        },
                        {
                            "id": "ng2xid1",
                            "body": "Energy stocks pay decent dividend.  I have some top oil stocks. Those who bought Li stocks claiming oil to be worthless are getting the cold shoulder.  Look for consumer staple companies. They are all as boring as they can be.  But one needs soap, snacks, drinks.  They all print and have little volatility.",
                            "score": 2,
                            "author": "Vast_Cricket",
                            "created_utc": 1758779669,
                            "replies_count": 0
                        },
                        {
                            "id": "ng2xo1t",
                            "body": "Also container ship companies pay very good dividend. The risk is a disaster or war.",
                            "score": 2,
                            "author": "Vast_Cricket",
                            "created_utc": 1758779753,
                            "replies_count": 0
                        }
                    ],
                    "selftext": "For the past 2 years most of my portfolio has been TSLA, META, NVDA, and a few other unicorns who've seen a bump in share price with the introduction of AI.\n\nI recently sold off most of my shares in these companies and am looking to put my money somewhere relatively more stable; so, does anyone have any thoughts or recommendations for dividend stocks to watch right now?\n\nAny insight is welcome, I'm a very casual investor.",
                    "permalink": "https://reddit.com/r/stocks/comments/1npkzqd/valuedividend_stock_reccomendations/",
                    "subreddit": "stocks",
                    "created_utc": 1758740796,
                    "sort_method": "hot",
                    "num_comments": 29
                },
                {
                    "id": "1nhm2n2",
                    "url": "https://www.reddit.com/r/stocks/comments/1nhm2n2/stocks_are_going_up_today_because_worlds_richest/",
                    "score": 2471,
                    "title": "Stocks are going up today because world's richest person bought his own stock!",
                    "author": "Turbulent-Push-4657",
                    "comments": [
                        {
                            "id": "necf9hf",
                            "body": "He bought $1 billion in stock. Market cap went up $100 billion. \n\nHow much did he increase his own net worth",
                            "score": 1429,
                            "author": "FalseListen",
                            "created_utc": 1757943804,
                            "replies_count": 2
                        },
                        {
                            "id": "necmheh",
                            "body": "Is he actually the richest person in the world? Would think some Saudi prince would be a lot richer",
                            "score": 114,
                            "author": "AlternativeOwn3387",
                            "created_utc": 1757946092,
                            "replies_count": 2
                        },
                        {
                            "id": "necozfr",
                            "body": "We are in a bubble so big it’s the size of gokus spirit bomb in namek",
                            "score": 217,
                            "author": "goldtank123",
                            "created_utc": 1757946844,
                            "replies_count": 2
                        },
                        {
                            "id": "nech8ts",
                            "body": "You're acting like there isn't an SEC that watches closely for any shenanigans   /s",
                            "score": 103,
                            "author": "luv2block",
                            "created_utc": 1757944451,
                            "replies_count": 1
                        }
                    ],
                    "selftext": "It is becoming a self full-filling setup. Mr. Musk buys $1B worth of TSLA stock, which he is employed with, earned that $1B from TSLA, and will get $1B performance pay from TSLA. So, the same money is circulated.\n\nEarlier ORCL and top few companies teamed up to buy/sell among each other to boost their own stock evaluations. It is circular cash flow with in the top few companies. The result was an unbelievable 2 hour boost of 35%+ to a billion dollar company! Since we have more information now a days than what it was 50 years ago (it was via news papers only), this type of sudden move is insane.\n\nIs there any precedence to this situation and what to expect in the stock investment near-term and long-term?",
                    "permalink": "https://reddit.com/r/stocks/comments/1nhm2n2/stocks_are_going_up_today_because_worlds_richest/",
                    "subreddit": "stocks",
                    "created_utc": 1757943429,
                    "sort_method": "hot",
                    "num_comments": 367
                },
                {
                    "id": "1njhhw8",
                    "url": "https://www.reddit.com/r/stocks/comments/1njhhw8/should_american_investors_be_concerned_about/",
                    "score": 34,
                    "title": "Should American Investors Be Concerned About China's Slowdown?",
                    "author": "Ancient-Stock-3261",
                    "comments": [
                        {
                            "id": "neq78rc",
                            "body": "Hi, you're on r/Stocks, please make sure your post is related to stocks or the stockmarket or it will most likely get removed as being off-topic/political; feel free to edit it now and be more specific.\n\n**To everyone commenting:**  Please focus on how this affects the stock market or specific stocks or it will be removed as being off-topic/political.\n\nIf you're interested in just politics, see our wiki on [\"relevant subreddits\"](https://www.reddit.com/r/stocks/wiki/index/#wiki_relevant_subreddits) and post to those Reddit communities instead without linking back here, thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*",
                            "score": 1,
                            "author": "AutoModerator",
                            "created_utc": 1758125625,
                            "replies_count": 0
                        },
                        {
                            "id": "neqr6wn",
                            "body": "China's problem has always struck me as a first class problem: \n\nTheir issue is literally being too good at making stuff. \n\nI feel like investors have missed the forest for the trees with China.",
                            "score": 28,
                            "author": "notapersonaltrainer",
                            "created_utc": 1758131262,
                            "replies_count": 1
                        },
                        {
                            "id": "neq8h76",
                            "body": "Nah no matter what number only go up.",
                            "score": 19,
                            "author": "VendettaKarma",
                            "created_utc": 1758125982,
                            "replies_count": 1
                        },
                        {
                            "id": "ner6psu",
                            "body": "China has been in a slowdown for a few years now already.",
                            "score": 2,
                            "author": "gryffon5147",
                            "created_utc": 1758135717,
                            "replies_count": 0
                        },
                        {
                            "id": "neqv8h3",
                            "body": "I don't take anyone seriously who includes hard numbers as we live in a world where our rulers just toss them out or adjust them at will lol. \n\nAnd the same world where we just continue to print more money and applaud 1% insider trading. \n\nAmerica has nothing to worry about. But anyone reading this thread probably does as it'll be us it affects...the peasants lol.",
                            "score": 3,
                            "author": "btoned",
                            "created_utc": 1758132395,
                            "replies_count": 0
                        },
                        {
                            "id": "nespjxq",
                            "body": "You are not afraid of the potential recession/stagnation caused by the Tariff?  Visit the tariff sub and you will find out how many small business and individuals not buying things due to the cost of",
                            "score": 3,
                            "author": "FormalAd7367",
                            "created_utc": 1758152491,
                            "replies_count": 1
                        },
                        {
                            "id": "neqg624",
                            "body": "I’m not worried about their slowdown, I’m worried about their overproduction wrecking companies worldwide.",
                            "score": 6,
                            "author": "kukugege",
                            "created_utc": 1758128170,
                            "replies_count": 1
                        },
                        {
                            "id": "neqb3yp",
                            "body": "IMO not really, this has been going on since atleast 2022, they just keep running various stimulus programs to stave it off.\n\nhttps://www.cnbc.com/2024/11/08/china-expected-to-announce-highly-anticipated-fiscal-stimulus-package.html\n\nHere's an example from last year",
                            "score": 4,
                            "author": "DONNIENARC0",
                            "created_utc": 1758126736,
                            "replies_count": 0
                        },
                        {
                            "id": "neqredk",
                            "body": "Apple should ",
                            "score": 1,
                            "author": "postercars",
                            "created_utc": 1758131322,
                            "replies_count": 0
                        }
                    ],
                    "selftext": "The most recent data from China showed that retail sales were up 3.4%, fixed-asset investment was just up 0.5%, and industrial production was up 5.2% YoY (the lowest in a year). This suggests a decline in local demand, which might have an impact on commodities, multinational corporations (AAPL, TSLA, NKE), and international commerce.\n\nOn the other hand, slower growth in China reduces inflation pressure, perhaps allowing the Fed to make cuts. Is domestic resiliency sufficient to keep stocks rising, or does this become a drag on U.S. earnings?",
                    "permalink": "https://reddit.com/r/stocks/comments/1njhhw8/should_american_investors_be_concerned_about/",
                    "subreddit": "stocks",
                    "created_utc": 1758125625,
                    "sort_method": "hot",
                    "num_comments": 41
                },
                {
                    "id": "1nbo9zy",
                    "url": "https://www.reddit.com/r/stocks/comments/1nbo9zy/tsla_to_lose_major_revenue_source/",
                    "score": 750,
                    "title": "TSLA to lose major revenue source",
                    "author": "nat-n-emore",
                    "comments": [
                        {
                            "id": "nd33h52",
                            "body": "Tesla will go higher the more money it loses.",
                            "score": 851,
                            "author": "FarrisAT",
                            "created_utc": 1757339955,
                            "replies_count": 2
                        },
                        {
                            "id": "nd37l7z",
                            "body": "somehow Tesla will climb to new all-time high.",
                            "score": 191,
                            "author": "graphic-dead-sign",
                            "created_utc": 1757341247,
                            "replies_count": 1
                        },
                        {
                            "id": "nd33jbs",
                            "body": "This has been looking for a while and was the reason for the fallout between Trump and Musk.\n\nDespite this and dropping Sales abroad, TSLA valuation is still crazy high. And I honesty wonder who buys at this price and keeps the price up.",
                            "score": 155,
                            "author": "joe-re",
                            "created_utc": 1757339974,
                            "replies_count": 2
                        },
                        {
                            "id": "nd4ifcb",
                            "body": "Bad news for TSLA?\n\n\nTSLA +30%",
                            "score": 27,
                            "author": "EasyEar0",
                            "created_utc": 1757354934,
                            "replies_count": 0
                        },
                        {
                            "id": "nd3einm",
                            "body": "I read so many negative article in the past several months but this stock isnt budging and tanking. It’s probably the weirdest stock ever",
                            "score": 19,
                            "author": "NY10",
                            "created_utc": 1757343308,
                            "replies_count": 0
                        }
                    ],
                    "selftext": "Bloomberg is reporting that EV deregulation from the government in Washington will allow the Detroit automakers to stop purchasing regulatory credits from Tesla.  The sale of these credits have accounted for 40% of TSLA profits.  \n\n>GM has spent [$3.5 billion](https://www.sec.gov/ix?doc=/Archives/edgar/data/0001467858/000146785825000032/gm-20241231.htm) since 2022 purchasing so-called regulatory credits to help the company meet fuel economy and tailpipe emissions requirements – a less-needed currency if Trump’s policies stick. \n\n>Ford has similarly cut its own credit-purchase commitments by nearly $1.5 billion this year alone  \n  \n[https://www.bloomberg.com/news/articles/2025-09-07/detroit-s-carmakers-to-save-billions-in-trump-emissions-rollback](https://www.bloomberg.com/news/articles/2025-09-07/detroit-s-carmakers-to-save-billions-in-trump-emissions-rollback)\n\nHow low should TSLA go, once these numbers get factored in?",
                    "permalink": "https://reddit.com/r/stocks/comments/1nbo9zy/tsla_to_lose_major_revenue_source/",
                    "subreddit": "stocks",
                    "created_utc": 1757339434,
                    "sort_method": "hot",
                    "num_comments": 164
                },
                {
                    "id": "1n5dlpu",
                    "url": "https://www.reddit.com/r/stocks/comments/1n5dlpu/what_are_your_favorite_non_techai_stocks_or_etfs/",
                    "score": 118,
                    "title": "What are your favorite non tech/AI stocks or ETFs you feel are undervalued?",
                    "author": "Sad-Airman",
                    "selftext": "Hello all, looking to get away from the AI frenzy and explore other sectors.  Looking to position my port more heavily towards other sectors that are currently undervalued since the AI bull run started, as well as generally more defensive.  I do believe AI and tech is the future but the valuations are getting a little absurd to me, despite my friends saying otherwise and to keep buying at current levels (PLTR, TSLA, NVIDIA etc).  I've been looking at VNQ, some small cap etfs (seem very undervalued currently), mid cap, healthcare, utilities, energy, GLD, gold mining and others.\n\nBeen spending this weekend doing research however it would help a ton to hear any ideas you all have and see if there is a pattern of recommendations at all.  Appreciate any tips, and hope you all have a good holiday tomorrow!",
                    "permalink": "https://reddit.com/r/stocks/comments/1n5dlpu/what_are_your_favorite_non_techai_stocks_or_etfs/",
                    "subreddit": "stocks",
                    "created_utc": 1756695701,
                    "sort_method": "hot",
                    "num_comments": 65
                },
                {
                    "id": "1n42jj2",
                    "url": "https://www.reddit.com/r/stocks/comments/1n42jj2/tesla_stock_price_engineered_not_earned_analyst/",
                    "score": 622,
                    "title": "Tesla Stock Price 'Engineered, Not Earned,' Analyst Says As Call Buying Surge Drives Put-To-Call Ratio Down",
                    "author": "Hour-End-4105",
                    "selftext": ">Johnson, an analyst at **GLJ Research**, alleged on Friday that Tesla’s stock prices are being artificially supported through options market manipulation rather than fundamental performance.\n\n>“TSLA isn’t trading on fundamentals – it’s being actively manipulated through the options market,” Johnson wrote on X. “Despite abysmal news, the stock is flat. Why? Someone is aggressively buying calls.”\n\n>Johnson cited data showing Tesla’s put-to-call ratio collapsed from 0.85x to 0.67x in a single day, indicating increased bullish options activity. Tesla closed at $333.87, down 3.50% on Friday.  \nCurrent options metrics show Tesla’s volume ratio at 0.61, suggesting more call options than puts are being traded. The implied volatility stands at 44.88%, above the historic volatility of 40.95%.\n\n>Johnson’s analysis referenced trading data showing Tesla’s stock price movement from approximately $160 to peaks near $480, with recent stabilization around $320-350. The company maintains a market cap of $1.05 trillion with a price to earnings ratio of 193.51.\n\n[https://www.benzinga.com/markets/equities/25/08/47429915/tesla-stock-engineered-not-earned-says-gordon-johnson-as-call-buying-surge-drives-put-to-call-ratio-down](https://www.benzinga.com/markets/equities/25/08/47429915/tesla-stock-engineered-not-earned-says-gordon-johnson-as-call-buying-surge-drives-put-to-call-ratio-down)\n\nInteresting to think what could be driving this. Doubt it's retail given the capital requirements needed to pull this off, plus TSLA sentiment on WSB is mixed at best, tilting more towards negative.",
                    "permalink": "https://reddit.com/r/stocks/comments/1n42jj2/tesla_stock_price_engineered_not_earned_analyst/",
                    "subreddit": "stocks",
                    "created_utc": 1756562929,
                    "sort_method": "hot",
                    "num_comments": 178
                },
                {
                    "id": "1n47cuu",
                    "url": "https://www.reddit.com/r/stocks/comments/1n47cuu/my_8yo_is_destroying_my_returns_and_beating_the_sp/",
                    "score": 2574,
                    "title": "My 8yo is destroying my returns and beating the S&P",
                    "author": "Brewskwondo",
                    "selftext": "Four years ago my 4yo daughter (now 8yo) started her UGMA account with just $200 and added $50/month. Today her account is worth $4,535.56, up +44.97% overall with an unrealized gain of +$1,390.97.\n\nHere’s how her top positions look right now:\n\t•\tNVDA – +$383.51 (+929.05%)\n\t•\tNFLX – +$418.00 (+458.53%)\n\t•\tCAT – +$46.53 (+88.01%)\n\t•\tGOOG – +$274.54 (+83.55%)\n\t•\tAAPL – +$59.88 (+79.60%)\n\t•\tMAR – +$39.44 (+75.69%)\n\t•\tAMZN – +$75.66 (+66.14%)\n\t•\tTSLA – +$34.91 (+46.69%)\n\t•\tK (Kellogg) – +$19.03 (+38.07%)\n\nFor context, if she had just put the same money into the S&P 500, her account would be worth about $4,320 meaning she’s outperforming the index by roughly +5%. Even better, she’s beating me too since my own portfolio is about 2% below the index, she’s actually ahead of me by about +7%.\n\nMy other daughter (5yo) who started hers a year ago with $200 initial and $50/mo is outperforming the index by 4% as well. I give up. I’m hiring them to manage my accounts. \n\nEdit: Hilarious to me that this got flagged as misleading or unverified. I literally tried to post the image of the account with the same info above but this sub wouldn’t let me attach images. ",
                    "permalink": "https://reddit.com/r/stocks/comments/1n47cuu/my_8yo_is_destroying_my_returns_and_beating_the_sp/",
                    "subreddit": "stocks",
                    "created_utc": 1756574798,
                    "sort_method": "hot",
                    "num_comments": 395
                },
                {
                    "id": "1mt9vr5",
                    "url": "https://www.reddit.com/r/stocks/comments/1mt9vr5/does_value_investing_still_work_in_this_market/",
                    "score": 114,
                    "title": "Does value investing still work in this market?",
                    "author": "sedate_matron",
                    "selftext": "Been watching names like TSLA, RDDT, APPL and COIN, but honestly it feels like earnings and fundamentals barely matter right now. Sometimes great numbers come out and the stock still tanks, or the opposite happens. Makes me wonder if the old-school way of picking stocks by digging into reports and waiting for “fair value” still works, or if it is time to focus more on sentiment, money flow and other stuff. ",
                    "permalink": "https://reddit.com/r/stocks/comments/1mt9vr5/does_value_investing_still_work_in_this_market/",
                    "subreddit": "stocks",
                    "created_utc": 1755484123,
                    "sort_method": "hot",
                    "num_comments": 85
                },
                {
                    "id": "1mmwihz",
                    "url": "https://www.reddit.com/r/stocks/comments/1mmwihz/centene_cnc_is_a_good_long_term_opportunity_at/",
                    "score": 19,
                    "title": "CENTENE (CNC) is a good long term opportunity at this level",
                    "author": "PleasantAnomaly",
                    "selftext": "Like every self-respecting Value investor, I've been looking for opportunities to divest from my tech-heavy portfolio. AI Stocks like NVDA, PLTR, MSFT, AMZN, TSLA have done great, but some of these valuations just don't make sense and I don't think now is a good time to buy into them anymore.\n\nThat brings me to look for other opportunities. I don't think there's a better opportunity right now than the Healthcare sector.\n\nHistorically, Healthcare has outperformed the S&P, thanks to relatively stable stocks like CNC.\n\nLet's take a step back. What the f\\*%# happened to this stock in the past 2 months ?\n\nThey came out and :\n\n1. Said that their Medical Loss Ratio(MLR) will be much higher because claims are getting expensive\n2. Pulled guidance for 2025\n\nSince then, they've had their Q2 Earnings call. They've revised guidance to a EPS of 1.75 for 2025 (from 7.5 previously, ouch). Given that their Q1 2025 EPS was 2.9, and their Q2 EPS was -0.16, this is pricing in a combined -1$ EPS for Q3 and Q4.\n\nThe bar is very low. Even a small sign of life from the CEO, could send this stock easily back to the 40 - 50 range, as a path to profitability is starting to be priced into the stock.\n\nThe recent headwind, albeit very impactful in the short to medium-term, is temporary. the CEO has said that they have already completed rate re-filings in the 29 states by now, and that the rate decision for each states will be expected in September. The new rates that determine the amount of premiums received, will take into account the high cost for behavioral health(therapists, psychiatric meds etc...),  home health services, and expensive drugs (Wegovy, Ozempic...) .\n\nCompared to the giant UNH, CNC has a much better reputation, isn't under DOJ Investigation, and Ambetter, their Health Insurance Marketplace, has a claims denial rate of 14%, more than half that of UNH.\n\n# Path back to profitability :\n\nCEO and the team are now laser focused on restoring profitability by pulling the necessary levers :\n\n\\- identifying and reducing areas where claims have been too \"costly\"\n\n\\- increasing premium rates, to account for the challenging environment, and with a worst case scenario in mind (continued high morbidity and utilization rate)\n\n\\- hinting at a stock buyback in the Earnings call\n\n\\- Immune from tariff BS and TACO\n\n# Possible risks\n\n\\- The trend of high morbidity and drug use continues to escalate, leading to more people needing expensive surgeries and drugs ==> unlikely, as people who fear that their benefits are being taken away with OBBBA, have already stocked up on drugs/done surgeries\n\n\\- continued political pressure on healthcare costs with bills like the OBBBA ==> unlikely, as this bill seems to be a one-and-done on healthcare, and now the Administration will focus on other more pressing matters (Russia - Ukraine conflict, Inflation, crypto, tax bills for the rich etc ...).\n\nAlso, this is speculation, but I think the full impact of the OBBBA are wayyy overstated. The Congressional Budget Office estimates that by 2034, 16 million people will lose coverage, but that's a decade away. This will be accounted for in the rate re-pricing.\n\n\\- Risks of people changing Insurers because of higher rates ==> given that every Health insurer will be increasing rates, among them: Elevance, UNH, Molina, Blue Cross Blue Shield, CNC will be no exception. People won't switch because none of the other options are better. Centene's health plan is pretty competitive, and compared to Molina health who's the most affordable, Centene's has much better coverage(available across 29 states vs 8 for Molina)\n\nOverall, I think this is a compelling buy, not just for CNC, but for the Health care sector overall, as the benefits greatly outweigh the risk at this point. Historically, the Healthcare Sector has outperformed the S&P, and this is the perfect time to buy in.",
                    "permalink": "https://reddit.com/r/stocks/comments/1mmwihz/centene_cnc_is_a_good_long_term_opportunity_at/",
                    "subreddit": "stocks",
                    "created_utc": 1754865951,
                    "sort_method": "hot",
                    "num_comments": 16
                }
            ],
            "fetched_at": "2025-09-27T15:45:50.545Z"
        },
        "thetagang": {
            "count": 10,
            "posts": [
                {
                    "id": "1negfto",
                    "url": "https://i.redd.it/x7wprcqyvkof1.jpeg",
                    "score": 164,
                    "title": "[ TSLA ] CC 2027, all my shares ... collected $65,000",
                    "author": "Big-Sand5360",
                    "comments": [
                        {
                            "id": "ndon65k",
                            "body": "It's better than sitting and doing nothing. His average cost is like $230 so at $900 he is almost 4x-ing plus the credit. The chance of Tesla hitting $900 mark is slim I would say. That price point requires Tesla to go full FSD commercial.",
                            "score": 71,
                            "author": "Acceptable_Can3285",
                            "created_utc": 1757617080,
                            "replies_count": 3
                        },
                        {
                            "id": "ndohpl8",
                            "body": "Nice work. When the VIX futures expire next week we will get a nice pullback into the end of September.",
                            "score": 23,
                            "author": "AnyManufacturer6465",
                            "created_utc": 1757615503,
                            "replies_count": 1
                        },
                        {
                            "id": "ndowvpd",
                            "body": "you have 1.2 million already- that is 5% already",
                            "score": 10,
                            "author": "ajkdd",
                            "created_utc": 1757619928,
                            "replies_count": 1
                        },
                        {
                            "id": "ndomy4m",
                            "body": "Strike is wayyyyy too high. Leaving prems on the table",
                            "score": 18,
                            "author": "ItsSevii",
                            "created_utc": 1757617015,
                            "replies_count": 2
                        }
                    ],
                    "selftext": "Playing it safe 😁\n\nSold CC : TSLA 36 contracts , strike $960 , dte 12/18/2026 , credit $18.20\n\nPremiun Collect : $65,000 🏧💵\n\nMaybe will close on pull back... 🤔 when credit down around ~$15.20 \n",
                    "permalink": "https://reddit.com/r/thetagang/comments/1negfto/tsla_cc_2027_all_my_shares_collected_65000/",
                    "subreddit": "thetagang",
                    "created_utc": 1757615061,
                    "sort_method": "hot",
                    "num_comments": 98
                },
                {
                    "id": "1n4p6g6",
                    "url": "https://i.redd.it/dh3v8jgicbmf1.jpeg",
                    "score": 66,
                    "title": "What the hell am I doing?!  Caught myself chasing wins on a 0DTE just for $.90 :(.",
                    "author": "cwhitel",
                    "comments": [
                        {
                            "id": "nbnq1pt",
                            "body": "That's $0.90 you didn't have before. Congrats!",
                            "score": 30,
                            "author": "the_humeister",
                            "created_utc": 1756646611,
                            "replies_count": 0
                        },
                        {
                            "id": "nbn6zng",
                            "body": "Great way to blow up an account - glad you recognized it.",
                            "score": 24,
                            "author": "OkAnt7573",
                            "created_utc": 1756638629,
                            "replies_count": 0
                        },
                        {
                            "id": "nboyw2l",
                            "body": "you 15x'd that suckah. Do this another 10 times in a row, and you'll be a millionaire.",
                            "score": 13,
                            "author": "feelinggoodabouthood",
                            "created_utc": 1756660338,
                            "replies_count": 0
                        },
                        {
                            "id": "nbo8vrt",
                            "body": "But shit, it was 99 cents!",
                            "score": 7,
                            "author": "bobdole145",
                            "created_utc": 1756652574,
                            "replies_count": 0
                        },
                        {
                            "id": "nbottmd",
                            "body": "*Another day, another dollar!*",
                            "score": 7,
                            "author": "Lukakukakukaku",
                            "created_utc": 1756658872,
                            "replies_count": 0
                        },
                        {
                            "id": "nbnz3ex",
                            "body": "Set a limit that pays your fees, since we’re being petty, and don’t look back.  TSLA has one of its quick phantom gain days and you’re closed, done, fini.  The thing’s already paid for, you can just move on with your trading.  They can’t all be gems.\n\nMaybe not in risky dte, but I’m a big fan of trading pettiness when playing with market makers.  I don’t come anywhere near paying fees for exceeding the 360 limit but very often am watching the volume and price action to gauge who I’m playing against and what the long or short trend is in order to position my offer advantageously instead of offering the mid and hoping.  Doing such things as policy instead of pettiness will slightly increase profit and understanding of option exchange mechanics.",
                            "score": 5,
                            "author": "Terrible_Champion298",
                            "created_utc": 1756649647,
                            "replies_count": 1
                        },
                        {
                            "id": "nbqtiz2",
                            "body": "A lot of people will tell you a win is a win, but when you realize what you are sacrificing for a win a different narrative emerges. So I would say a 90 cent win is just as good as a $1000 plus or minus, if you learned a lesson. Good luck and congratulations on getting paid to learn something.",
                            "score": 3,
                            "author": "Putrid_Alarm430",
                            "created_utc": 1756681339,
                            "replies_count": 0
                        },
                        {
                            "id": "nbpoiuo",
                            "body": "you only made $ if your commission fees are less than $0.45.\n\nlately, for short-term TSLA trades I've dabbled with shares of the option ETFs\n\nTSLL:\n\n- has more volume than TSLA\n\n- has no commission fees with most brokers nowadays\n\ncan make that $0.90 in a few well-timed minutes with a 50-100 shares :)",
                            "score": 1,
                            "author": "m0nk_3y_gw",
                            "created_utc": 1756667991,
                            "replies_count": 1
                        }
                    ],
                    "selftext": "Disappointed with myself I’ve gotten to this level of pettiness.  \n\nAs punishment to myself I’ve stuck on a far OTM, 0.1 delta 45 day call so I can think about what I’ve done. Forcing myself back into boring strategy’s, not chasing green numbers!\n",
                    "permalink": "https://reddit.com/r/thetagang/comments/1n4p6g6/what_the_hell_am_i_doing_caught_myself_chasing/",
                    "subreddit": "thetagang",
                    "created_utc": 1756627861,
                    "sort_method": "hot",
                    "num_comments": 15
                },
                {
                    "id": "1m8ejkq",
                    "url": "https://www.reddit.com/r/thetagang/comments/1m8ejkq/issue_with_selling_tsla_spread_on_ibkr_today/",
                    "score": 12,
                    "title": "Issue with selling TSLA spread on IBKR today",
                    "author": "wyterk",
                    "comments": [
                        {
                            "id": "n4yo2g6",
                            "body": "Lmao 2 cent credit",
                            "score": 31,
                            "author": "Dealer_Existing",
                            "created_utc": 1753387644,
                            "replies_count": 1
                        },
                        {
                            "id": "n4ymshx",
                            "body": "Why would you even place this trade? If you don’t know there is a 0.65$ commission on each leg, then all I can say is, read up on finer points.",
                            "score": 27,
                            "author": "hv876",
                            "created_utc": 1753387288,
                            "replies_count": 1
                        },
                        {
                            "id": "n4yp5eg",
                            "body": "Hilarious",
                            "score": 14,
                            "author": "Illustrious-Load-919",
                            "created_utc": 1753387943,
                            "replies_count": 0
                        },
                        {
                            "id": "n4z0e7z",
                            "body": "You paid the broker to pick up the pennies.. Usually you get a breakout of the trade before you hit confirm so you had to have seen the trade was going to cost you money.. ",
                            "score": 8,
                            "author": "deathdealer351",
                            "created_utc": 1753391098,
                            "replies_count": 0
                        },
                        {
                            "id": "n4zq3wk",
                            "body": "Am I correct in reading that you desired outcome for this trade, independent of the commissions question, was that you would receive 2cents per spread X 30 spreads =  60 cents?",
                            "score": 6,
                            "author": "poppinandlockin25",
                            "created_utc": 1753399164,
                            "replies_count": 2
                        },
                        {
                            "id": "n4ytfrj",
                            "body": "Don't be pussy, sell 350p 1dte.",
                            "score": 5,
                            "author": "UnnameableDegenerate",
                            "created_utc": 1753389140,
                            "replies_count": 1
                        },
                        {
                            "id": "n4z8f76",
                            "body": "Upvoting for being so stupid and hilarious.",
                            "score": 3,
                            "author": "Briggity_Brak",
                            "created_utc": 1753393465,
                            "replies_count": 0
                        },
                        {
                            "id": "n4zgmju",
                            "body": "Trade fees are not uncommon, and you were likely told what those would be before you accepted the IBKR terms for trading options.  Probably best not to embarrass yourself taking this matter up with them.",
                            "score": 3,
                            "author": "Terrible_Champion298",
                            "created_utc": 1753396035,
                            "replies_count": 0
                        }
                    ],
                    "selftext": "I sold a far OTM 1DTE bull put spread today (210/200 strikes). I am supposed to receive a 2 cents credit. But the fees to place this trade cost me more than the credit I received and I got a negative credit after I placed the trade\n\nIBKR didn't show me this during preview but only after I placed the trade (or maybe it did but I didn't notice). \n\nAre the fees so high because the strike is so OTM? ",
                    "permalink": "https://reddit.com/r/thetagang/comments/1m8ejkq/issue_with_selling_tsla_spread_on_ibkr_today/",
                    "subreddit": "thetagang",
                    "created_utc": 1753387003,
                    "sort_method": "hot",
                    "num_comments": 29
                },
                {
                    "id": "1m46soi",
                    "url": "https://www.reddit.com/r/thetagang/comments/1m46soi/new_tsla_collar_trade/",
                    "score": 0,
                    "title": "New TSLA Collar Trade",
                    "author": "fridaynighttrader",
                    "comments": [
                        {
                            "id": "n427i17",
                            "body": "The main issue with this trade that I have is that the price of tsla needs to be higher at or around expiration.  Tesla is so volatile that it constantly goes through so many cycles that it would be difficult to cash in before expiry.  If tsla spikes up in price somewhere around october, any gains in your underlying srock would be vastly outperformed by the cost of buying back the short call.\n\nAs such the probability of you making money on this trade is wholly dependent on what happens december.  If this was any other stock where there is a gradual expectation of price increasing as time goes on this might be a better collar.\n\nEdit: Ironically i would be morr of a fan of the startegy completely reverse yours... buying a 400 strike call dec 17th and then selling a Cash secured put at 314 strike.  This allows me flexibility in cashing in on thr ups and downs of the stock",
                            "score": 5,
                            "author": "Elricboy",
                            "created_utc": 1752959937,
                            "replies_count": 0
                        },
                        {
                            "id": "n45cjgh",
                            "body": "Why not use a leap instead of shares? \n\nIf the stock price rips up at some point, will you roll up your long put?",
                            "score": 1,
                            "author": "DramaticAlbatross",
                            "created_utc": 1753010168,
                            "replies_count": 1
                        },
                        {
                            "id": "n4abnwi",
                            "body": "I did a weird riskless collar recently also. I am not sure how well it paid off yet but it was fun.\n\nI bought a riskless collar on IBIT but only 8 days before expiration. For each spread (bought 64.5p, sold 64.5c, bought IBIT at 64.40) bought I would received $7 after commissions, a hair over the risk-free rate. However, I  think I used very little margin on the trade thanks to the put. If it didn't use any margin, it's kind of a free month glitch thanks to IBIT's mega call skew paying for my puts. My broker stinks when it comes to reporting margin interest so I will have to check what was used at the end of the month. \n\nThe part I liked most about the trade was betting on the calls getting assigned early. If my shares got called away, I would not need the puts anymore and they would be pure profit, since they were paid for by selling the calls. Alas, even with the IBIT pump they did not get assigned till after expiration and my puts expired worthless.",
                            "score": 1,
                            "author": "calebsurfs",
                            "created_utc": 1753072053,
                            "replies_count": 1
                        },
                        {
                            "id": "n424wwb",
                            "body": "You're late. I already collared NVDA.",
                            "score": 0,
                            "author": "MostlyH2O",
                            "created_utc": 1752959088,
                            "replies_count": 1
                        }
                    ],
                    "selftext": "I figured i would share one of the new trades I put on last week and plan to hold as close to expiration as I need to. I've traded many positions like this with no downside risk in the past and have grown to really appreciate the use of the \"collar\" trade (with an adjustment of course).\n\nWhat is the collar in options trading?\n\nA traditional collar strategy involves:\n\n\\-buying 100 shares of the underlying stock\n\n\\-short 1 call contract for a net credit\n\n\\-long 1 put contract for a net debit\n\nThis is most often used when someone who is holding the underlying shares of the company is neutral to bearish about the stock's performance over the next period of time and wants to hedge the stock. You can often do this in a way that will be considered a \"costless collar\" if you can successfully receive enough premium from the short call option to completely offset the cost of buying the long put option. If you do put on a costless collar you will give up a portion of your upside potential to hedge your downside losses either 100% or very close depending on what your strikes you use when putting these trades on.\n\nThese strategies usually are put on in a way where the upside is almost completely negated. I prefer to have more upside potential and therefore i structure my collar's differently than the traditional method by using an out of the money short call that is still a large enough credit to finance my long at the money put. This results in the below photo which shows 0 downside risk over the entire trade and the ability to profit off of TSLA moving up to 27% by expiration.\n\nI know what you're thinking.... How can there be no downside risk to this trade? isn't that impossible? Well, it's not impossible to find trades that have no downside risk but the reality of them is that they usually never yield more than the risk-free rate (buying US treasuries that yield 4.5% annually).\n\nIn this case TSLA would need to move 27% by December 17th, 2027, for this max profit of $9,055 to come to fruition. If TSLA expires anywhere from +0%-26% i will profit according to the linear P/L line you see on the chart. If TSLA expires anywhere below the price I started the trade at of 314.87/share then the short call would expire worthless and the long put would expire in the money and i could exercise it to put my 100 shares away and end up with no position in my account and i will have profited $55 no matter how far down TSLA ends up.\n\nThis type of trade is definitely not for everyone as those with more bullish outlooks on TSLA might not want to limit their upside to 27% but for me it perfectly fit the risk profile I'm comfortable with when i think of TSLA. Would you take this trade?\n\n\n[TSLA Collar](https://optionstrat.com/hICqEy8quarY)",
                    "permalink": "https://reddit.com/r/thetagang/comments/1m46soi/new_tsla_collar_trade/",
                    "subreddit": "thetagang",
                    "created_utc": 1752958488,
                    "sort_method": "hot",
                    "num_comments": 8
                },
                {
                    "id": "1m99dxk",
                    "url": "https://i.redd.it/7os3gwr3u2ff1.jpeg",
                    "score": 86,
                    "title": "Had a damn good July, how’d the gang do?",
                    "author": "Stunning_Ad_6600",
                    "comments": [
                        {
                            "id": "n55h4zu",
                            "body": "Pretty much just won’t stop going up, not complaining but it feels too easy.  Something will give soon.  +$21k in July alone.",
                            "score": 19,
                            "author": "SetOk6462",
                            "created_utc": 1753475630,
                            "replies_count": 1
                        },
                        {
                            "id": "n55igi2",
                            "body": "July has been +37k so far. I want next week to deliver another $6-8k and I’ll hit a record month.",
                            "score": 15,
                            "author": "gqreader",
                            "created_utc": 1753476013,
                            "replies_count": 1
                        },
                        {
                            "id": "n55tbyl",
                            "body": "Congrats! Market has been going up so it has been good for thetagang",
                            "score": 11,
                            "author": "Awkward_Possible_610",
                            "created_utc": 1753479278,
                            "replies_count": 0
                        },
                        {
                            "id": "n55lhia",
                            "body": "HOOD puts have been free money for the last 3 or 4 months. Until this week, I'll be assigned some shares. I don't mind though as I think they'll have a solid earnings call.",
                            "score": 19,
                            "author": "MoustacheMark",
                            "created_utc": 1753476890,
                            "replies_count": 2
                        },
                        {
                            "id": "n55nhb6",
                            "body": "Made thousands writing calls on OPEN.  Premiums are nuts.",
                            "score": 9,
                            "author": "marginmanj",
                            "created_utc": 1753477479,
                            "replies_count": 1
                        },
                        {
                            "id": "n55qe0z",
                            "body": "\\+7.5% so far this month, on \\~30k (just over 2k). Up almost 7k in the last 3 months. It's been good. Have to remind myself not to get complacent.",
                            "score": 9,
                            "author": "Internal-Homework",
                            "created_utc": 1753478368,
                            "replies_count": 1
                        },
                        {
                            "id": "n55g8h6",
                            "body": "Now show us your mutli month P&L. Everyone should have made money in this insane uptrend.",
                            "score": 16,
                            "author": "Agitated-Key4016",
                            "created_utc": 1753475365,
                            "replies_count": 1
                        }
                    ],
                    "selftext": "Been selling CSP’s like a madman with about 240k of capital. Trying not to overtrade and not hold over the weekend. How’d you guys do this month?",
                    "permalink": "https://reddit.com/r/thetagang/comments/1m99dxk/had_a_damn_good_july_howd_the_gang_do/",
                    "subreddit": "thetagang",
                    "created_utc": 1753473880,
                    "sort_method": "hot",
                    "num_comments": 67
                },
                {
                    "id": "1m7cs3h",
                    "url": "https://i.redd.it/ter1w5r3anef1.png",
                    "score": 21,
                    "title": "Implied, Average and Last Earnings Move For Tomorrow Releases",
                    "author": "___KRIBZ___",
                    "selftext": "",
                    "permalink": "https://reddit.com/r/thetagang/comments/1m7cs3h/implied_average_and_last_earnings_move_for/",
                    "subreddit": "thetagang",
                    "created_utc": 1753285577,
                    "sort_method": "hot",
                    "num_comments": 0
                },
                {
                    "id": "1m4yylt",
                    "url": "https://i.redd.it/1xkkeday73ef1.jpeg",
                    "score": 66,
                    "title": "Using Theta as my best friend. Road to $100k starting with 6k - Week 23 ended in $9,276",
                    "author": "UnbanMe69",
                    "selftext": "This week's headlines didn't really stick. But a few notable ones are core CPI inflation is up M/M. Core PPI came in cooler than expected. Markets shrugged off Tariff headlines ahead of August 1st deadline, Bitcoin whale selling for $9.5B profit. \n\nLet's get into this week's trade:\n\n**$LUNR**\n\nI initially opened a $10 cash secured puts for a net credit of +$19 citing the demand zone around $9.5-10. I was able to close this trade the same week for a debit of $4 bringing my net profit to +$15.\n\n* **07/15/2025 Sell to Open:**\n   * LUNR 07/25/2025 10.00 P\n   * Quantity: 1\n   * Credit: $19\n* **07/17/2025 Buy to Close:**\n   * LUNR 07/25/2025 10.00 P\n   * Quantity: 1\n   * Debit: -$4\n   * Net Profit: $15\n\nI will continue to bid $LUNR cash secured puts if the opportunity permits ahead of IM-3 launch and potential NASA contracts.\n\n**$TSLL**\n\nI previously had rolled from 10 strike down to 9.5 strike last week, and the week previous that I rolled down from 10.5 strike. This week I was able to close both of the 9.5s strike for net profit from all the previous rolls.\n\nI closed the 7/18 contract for a debit of $1. Bringing my total net profit to +$51 from all the previous rolls\n\n* **07/16/2025 Buy to Close:**\n   * TSLL 07/18/2025 9.50 P\n   * Quantity: 1\n   * Debit: -$1.00\n   * Total Net Profit: +$51 (including previous rolls)\n\nThe second 9.5 contract I had rolled to TSLA earnings week but given that the trade was up over +70% from the rolls, I decided to stick to my playbook and close the trade. My general rule of thumb is that if the trade is over 50% with more than a week left to go, it is wise to close to and re-deploy the capital elsewhere.\n\n* **07/18/2025 Buy to Close:**\n   * TSLL 07/25/2025 9.50 P\n   * Quantity: 1\n   * Debit: -$9\n   * Total Net Profit: +$27 (including previous roll)\n\n**$OSCR**\n\nLast week I had opened a $15 cash secured puts on OSCR. Based on the chart I believed that there was more downside to OSCR so I gave myself some room to roll as needed. I rolled down and out last week from $15 to $14 for net credit. This week I rolled down again from $14 to $13.5 for additional net credits. \n\n* **07/17/2025 Buy to Close:**\n   * OSCR 07/18/2025 14.00 P\n   * Quantity: 1\n   * Debit: -$12\n* **07/17/2025 Sell to Open:**\n   * OSCR 07/25/2025 13.50 P\n   * Quantity: 1\n   * Credit: $37\n   * Net Credit from rolling: $25\n\nI also had a $12 cash secured puts that I opened last week for a net credit of +$25. I was able to close that trade this week for $1 debit, bringing my net profit to +$24.\n\n* **07/16/2025 Buy to Close:**\n   * OSCR 07/18/2025 12.00 P\n   * Quantity: 1\n   * Debit: -$1.00\n   * Total Net Profit: +$24\n\nAs the week progressed, OSCR dropped so I saw the opportunity and took it based on the demand zone around $13-14. I opened 2 new contracts going into next week.\n\n* **07/17/2025 Sell to Open:**\n   * OSCR 07/25/2025 11.50 P\n   * Quantity: 1\n   * Credit: $20\n* **07/18/2025 Sell to Open:**\n   * OSCR 07/25/2025 11.00 P\n   * Quantity: 1\n   * Credit: $24\n\nI will be closely monitoring my $13.5 strike and will roll down and out as needed for additional net credits. The $11 and $11.5 strikes are what I call cash grabs.\n\n**$MSTX**\n\nAs the Crypto market first saw the headline of Bitcoin whales selling for over $9.5B profit, it slightly pulled back. I saw this as an opportunity to deploy some cash secured puts with giving myself enough wiggle room to continue to roll as needed. I expect further downside on BTC / MSTR based on the charts so I position my CSP to roll next week as needed.\n\n* **07/18/2025 Sell to Open:**\n   * MSTX 07/25/2025 31.00 P\n   * Quantity: 1\n   * Credit: $25\n\n**As of July 20, 2025, here's what's in my portfolio:**\n\n* 1 cash secured put on $OSCR at $13.50 strike (07/25 expiry)\n* 1 cash secured put on $OSCR at $11.50 strike (07/25 expiry)\n* 1 cash secured put on $OSCR at $11.00 strike (07/25 expiry)\n* 1 cash secured put on $MSTX at $31.00 strike (07/25 expiry)\n* $2,752.20 Cash reserves awaiting potential market pullback opportunities\n* Weekly $100 deposit on Wed and Fri splits\n\nYTD realized gain of [\\+$1,351.94](https://sellingoptionshq.com/blog/road-to-100k-week-23#realized) and a win/loss ratio of [60.97%](https://sellingoptionshq.com/blog/road-to-100k-week-23#realized)\n\nGood luck out there",
                    "permalink": "https://reddit.com/r/thetagang/comments/1m4yylt/using_theta_as_my_best_friend_road_to_100k/",
                    "subreddit": "thetagang",
                    "created_utc": 1753042739,
                    "sort_method": "hot",
                    "num_comments": 43
                },
                {
                    "id": "1m352vh",
                    "url": "https://i.redd.it/nzpybfkfgndf1.png",
                    "score": 25,
                    "title": "Earnings Calendar By Implied Move - July 21st",
                    "author": "___KRIBZ___",
                    "selftext": "",
                    "permalink": "https://reddit.com/r/thetagang/comments/1m352vh/earnings_calendar_by_implied_move_july_21st/",
                    "subreddit": "thetagang",
                    "created_utc": 1752851849,
                    "sort_method": "hot",
                    "num_comments": 8
                },
                {
                    "id": "1lqxpw3",
                    "url": "https://www.reddit.com/r/thetagang/comments/1lqxpw3/tsla_puts_eviscerated_by_theta_today/",
                    "score": 49,
                    "title": "TSLA puts eviscerated by Theta today",
                    "author": "PaymentNecessary1667",
                    "selftext": "\nHey all, my 315 puts expired today, at the end of the day the trade was coming my way as far as the stock price but…I really saw the theta suck my profit at the end, I kept losing more and more finally closed in disgusting fashion.\n\nIs theta this lethal on date of expiration?\n\nThanks in advance for your feedback I’m newish to trading. ",
                    "permalink": "https://reddit.com/r/thetagang/comments/1lqxpw3/tsla_puts_eviscerated_by_theta_today/",
                    "subreddit": "thetagang",
                    "created_utc": 1751568937,
                    "sort_method": "hot",
                    "num_comments": 37
                },
                {
                    "id": "1lro69t",
                    "url": "https://www.reddit.com/r/thetagang/comments/1lro69t/series_technical_analysis_six_months_1k_per_month/",
                    "score": 3,
                    "title": "Series Technical Analysis: Six Months - $1K per Month",
                    "author": "Pension2options",
                    "selftext": "Over the past year, been seeing people aiming for $1K a month selling theta, just thought seeing a ‘proof of concept’ would provide some encouragement to those seeking the path to success.\n\n\\--\n\nI achieve this via basic TA (just the 200sma, 50sma, down trend, fill the gaps) selling Naked PUTs FAR OTM and far out in Expiry--whatever you use to put the advantage on your side, you do you. gl and happy BD USA!\n\nhttps://preview.redd.it/s4g7nf8c7waf1.png?width=1060&format=png&auto=webp&s=ebbf4c6abb6ab56d4b5dba9f593e66288b8a5ca7\n\nHistory of present event:\n\nTake balance transfer cash (via the included check) of 0% intro APR of $15K and $24K for 12 months, earn interest on SPAXX 3.94% or FDLXX 3.90% (CA state tax exempt), and sell Naked PUTs.\n\n\\---\n\nThe numbers:\n\n[$15K at 4.99% one-time fee](https://www.reddit.com/r/thetagang/comments/1l3e5ei/unh_tsla_credit_card_balance_transfer_to_sell/): -$748.50\n\n[$24K at 5% one-time fee](https://www.reddit.com/r/thetagang/comments/1ktpw4s/rddt_goog_credit_card_balance_transfer_to_sell/): -$1,200\n\n[Premiums realized within 6 weeks covers all fees with some leftovers.](https://www.reddit.com/r/thetagang/comments/1liqkzi/fees_covered_in_6_wks_credit_card_balance/)\n\n\\--\n\nStatistics:\n\n\\-93% of traders lose because they run a 'Get-Rich-Quick Scheme'\n\n\\-7% of traders win because they do not run a 'Get-Rich-Quick Scheme'\n\n\\---\n\n*Disclaimer: Taking out a credit card balance transfer to sell Naked PUTs using TA, with a FICO score below 750, is worry worthy.*",
                    "permalink": "https://reddit.com/r/thetagang/comments/1lro69t/series_technical_analysis_six_months_1k_per_month/",
                    "subreddit": "thetagang",
                    "created_utc": 1751649517,
                    "sort_method": "hot",
                    "num_comments": 11
                }
            ],
            "fetched_at": "2025-09-27T15:45:55.983Z"
        },
        "StockMarket": {
            "count": 10,
            "posts": [
                {
                    "id": "1nnrb97",
                    "url": "https://www.reddit.com/gallery/1nnrb97",
                    "score": 369,
                    "title": "NVIDIA to Invest $100 Billion in Open AI – \"Additive\" to Current Guidance",
                    "author": "meifx",
                    "comments": [
                        {
                            "id": "nfmjhdv",
                            "body": "Isn't this classic circular accounting. They are giving them 100 b to buy their chips from them??\n\nNvidia is the biggest buyer of its chips, its just done i directly 🤔",
                            "score": 181,
                            "author": "Beginning-Art7858",
                            "created_utc": 1758559275,
                            "replies_count": 2
                        },
                        {
                            "id": "nfmkca8",
                            "body": "The peak must be near. It must.",
                            "score": 74,
                            "author": "FinnishSpeculator",
                            "created_utc": 1758559520,
                            "replies_count": 1
                        },
                        {
                            "id": "nfmpvwt",
                            "body": "TF is going on.\n\nIt seems so circular moving of hundreds of billions of dollars. These big guys rotating among themselves :D",
                            "score": 45,
                            "author": "goodpointbadpoint",
                            "created_utc": 1758561072,
                            "replies_count": 1
                        },
                        {
                            "id": "nfmuqcn",
                            "body": "This guys are giving money away to inflate their sales forecasts lol",
                            "score": 27,
                            "author": "dakameltua",
                            "created_utc": 1758562445,
                            "replies_count": 0
                        },
                        {
                            "id": "nfmm8fm",
                            "body": "Yeah $URMOM",
                            "score": 12,
                            "author": "topicalsyntax571",
                            "created_utc": 1758560047,
                            "replies_count": 0
                        },
                        {
                            "id": "nfn533k",
                            "body": "Infinite money glitch 😂😂😂",
                            "score": 10,
                            "author": "Dapper_Dune",
                            "created_utc": 1758565374,
                            "replies_count": 0
                        }
                    ],
                    "selftext": "Each 1 GW is $100 billion of investment (4 to 5 million GPUs) and is additive to current guidance.\n\n**\"This is just the first 10 Gigawatts\"**",
                    "permalink": "https://reddit.com/r/StockMarket/comments/1nnrb97/nvidia_to_invest_100_billion_in_open_ai_additive/",
                    "subreddit": "StockMarket",
                    "created_utc": 1758558727,
                    "sort_method": "hot",
                    "num_comments": 62
                },
                {
                    "id": "1nizsjm",
                    "url": "https://i.redd.it/t0ac9kcxmmpf1.jpeg",
                    "score": 454,
                    "title": "So U.S. becomes the world’s capital magnet?",
                    "author": "North_Reflection1796",
                    "comments": [
                        {
                            "id": "nemotwu",
                            "body": "That kind of goes with being the world reserve currency.",
                            "score": 259,
                            "author": "JoeCensored",
                            "created_utc": 1758072405,
                            "replies_count": 2
                        },
                        {
                            "id": "nemqkkc",
                            "body": "Not surprising, us has been the best place to invest. US, for the good and for the bad, is the most business friendly developed country ",
                            "score": 53,
                            "author": "BrotherDirect744",
                            "created_utc": 1758073025,
                            "replies_count": 2
                        },
                        {
                            "id": "nemq3jx",
                            "body": "Is there logarithmic graph instead?",
                            "score": 18,
                            "author": "Iwubinvesting",
                            "created_utc": 1758072858,
                            "replies_count": 0
                        }
                    ],
                    "selftext": "Since 2007, foreign ownership of U.S. financial assets has grown at an annual rate of 7.2%, far outpacing the 4.7% growth rate of U.S. ownership of foreign assets, reflecting the sustained global appetite for U.S. markets.\n\nWhile in Q1 2025, foreign investors held over $55 trillion in U.S. financial assets—almost 1.6 times the value of U.S. holdings abroad—underscoring America’s increasingly solid position as a net capital importer.\n\nKey turning points include the 2008 financial crisis and the 2020 pandemic, when U.S. equities and dollar assets attracted even more safe-haven flows, widening the gap further.\n\n***Source: Federal Reserve***\n\nStocks worth watching in recent market would be NVDA, AIFU, AMD, OKLO, TSLA, PLTR",
                    "permalink": "https://reddit.com/r/StockMarket/comments/1nizsjm/so_us_becomes_the_worlds_capital_magnet/",
                    "subreddit": "StockMarket",
                    "created_utc": 1758072152,
                    "sort_method": "hot",
                    "num_comments": 105
                },
                {
                    "id": "1nmsqvs",
                    "url": "https://i.redd.it/0ajqsa13yiqf1.jpeg",
                    "score": 26,
                    "title": "Week Recap: Fed cut interest rates by 25 bps and its first cut since December 2024. The Russell 2000 reached the all-time level since 2021 and 2024. The S&P 500 extended winning streak to 3-week. Sep. 15, 2025 – Sep. 19, 2025",
                    "author": "vjectsport",
                    "comments": [
                        {
                            "id": "nffgl60",
                            "body": "qcom definitely has legs. better resolution pictur please",
                            "score": 1,
                            "author": "Apprehensive_Two1528",
                            "created_utc": 1758467064,
                            "replies_count": 0
                        },
                        {
                            "id": "nfvkk12",
                            "body": "Hmmmm",
                            "score": 1,
                            "author": "AltoVera",
                            "created_utc": 1758678762,
                            "replies_count": 0
                        },
                        {
                            "id": "nffgi3j",
                            "body": "Bulls are unstoppable. We will see massive gains in the next years. No losses. We will get rich.",
                            "score": -1,
                            "author": "dummybob",
                            "created_utc": 1758467039,
                            "replies_count": 0
                        }
                    ],
                    "selftext": "First of all, I don't want to be misunderstood. This heat map is weekly that it visualized via closing prices from September 12 to September 19.\n\nGenerally, there is 3 main topic on this week that are FOMC meeting, TikTok's U.S. control, and Intel's stock purchasing. The week started quietly and then optimism increased step by step toward the end.\n\n📊 Here are the S&P 500's week-by-week results for the last 4 week,\n\nAugust 22 close at 6,466.91 - August 29 close at 6,460.27 🔴 (-0.10%)\n\nAugust 29 close at 6,460.27 - September 5 close at 6,481.52 🟢 (+0.33%)\n\nSeptember 5 close at 6,481.52 - September 12 close at 6,584.29 🟢 (+1.59%)\n\nSeptember 12 close at 6,584.29 - September 19 close at 6,664.39 🟢 (+1.22%)\n\n🔸 Monday: Volatility was low and volume is around the 20-day average during the first 3 of the week. Before the session, Trump said shift to six-month corporate reporting cycle. This would save money and improve management. The stock market opened slightly higher. In the session, Nasdaq extended gains and reach the 1%. The stock market closed higher. 🟢\n\n🔸 Tuesday: Before the session, Scott Bessent said 25 bps cut is priced-in. The stock market opened slightly higher as Monday. In the session, Tesla tried to extend gain and reach to 3%. Stephen Miran sworn in as governor. The stock market closed slightly lower. 🔴\n\n🔸 Wednesday: The Fed meeting arrived. Trade Advisor Navarro recommended the Fed should cut by 50 bps today and another 50 bps at next meeting. The stock market opened mixed, but there are nearly flat. Fed cut interest rates by 25 bps and its first time since December 2024. Gold fell around 1% after the decision. The stock market closed slightly lower. 🔴\n\n🔸 Thursday: Nvidia agreed to buy $5B stake from Intel and then Intel jumped more than 25% in a single day. The stock market opened higher. Trump said stocks will do much better as time goes by. Russell 2000 index hit 2,450 level and its all-time high from November 2021 and November 2024. It's a good sign for the momentum separated to all stocks for a long time. The S&P 500 and Nasdaq closed at all-time high. 🟢\n\n🔸 Friday: Trump asked Supreme Court to let him Fire Fed's Lisa Cook. The stock market opened mixed. Also, Friday was Triple Witching day which occurs quarterly on the third Friday of March, June, September, and December. Triple witching days can cause a spike in trading activity. As result, volume was highest level for last 5 months. Trump and China talked about TikTok. Trump made a call with President Xi of China and he said very productive and appreciate the TikTok approval. As result, Oracle gained more than 4%. The stock market closed higher and completed the week at all-time high. 🟢\n\nThe first rate cut is done. We could see two more cut in this year because labor market data revision damaged to Fed confidence. The next Fed meeting is in November. The probability of 25 point rate cut is 92% in CME FedWatch Tool. On the other hand, M2 Money Supply are supported to lower inflation. Russell 2000 reached to all-time high again after a long time. The stock market rally could continue in the nice period.\n\nWhat do you think? What do you think? How was your week?\n\n❓ Note: Many people have asked where screenshots come from in my previous posts. I'm using Stock+ on iPhone and iPad. You can find it on the App Store. If you're using Android, I'm now sure if it's available, but you can try searching \"Stock Map\" or \"Heat Map\". ",
                    "permalink": "https://reddit.com/r/StockMarket/comments/1nmsqvs/week_recap_fed_cut_interest_rates_by_25_bps_and/",
                    "subreddit": "StockMarket",
                    "created_utc": 1758463258,
                    "sort_method": "hot",
                    "num_comments": 3
                },
                {
                    "id": "1nbid66",
                    "url": "https://i.redd.it/38rpkwjijwnf1.jpeg",
                    "score": 118,
                    "title": "Buyback boom nearing its end?",
                    "author": "North_Reflection1796",
                    "comments": [
                        {
                            "id": "nd31t5w",
                            "body": "This is not serious\n\nIf you plotted the line from the very next bar to the right it would show the opposite trend",
                            "score": 17,
                            "author": "GreenPlasticChair",
                            "created_utc": 1757339418,
                            "replies_count": 2
                        },
                        {
                            "id": "nd1xekg",
                            "body": "atta boy, continue trying to time the market.",
                            "score": 78,
                            "author": "RackCitySanta",
                            "created_utc": 1757321085,
                            "replies_count": 2
                        },
                        {
                            "id": "nd1xlgg",
                            "body": "You should of posted this in 2018 when it would of looked very similar",
                            "score": 28,
                            "author": "Italianjobbob",
                            "created_utc": 1757321202,
                            "replies_count": 2
                        },
                        {
                            "id": "nd3qug2",
                            "body": "Yea so when economy is bad they stop buybacks and let the market dip. And then the company starts buybacks at a lower price creating shareholder wealth and that increases the market lol it’s perfectly normal. Thats what’s been happening in the last 100 years in s&p 500. \n\nAre we exhausted maybe? Will the markets come off the highs , yes probably lol but then the companies will do buybacks at lower share price.",
                            "score": 3,
                            "author": "QuantGuru",
                            "created_utc": 1757347006,
                            "replies_count": 0
                        },
                        {
                            "id": "nd6dm92",
                            "body": "Companies perform buybacks when they have plenty of capital and they view their own stock as a relative bargain to future expectations. It bolsters support by reducing supply vs demand and lowers their outstanding shares thus strengthening their financial position and creditworthiness. I do not believe you can chart the entire S&P 500 and draw conclusions about what individual companies will do.",
                            "score": 2,
                            "author": "Spankynpetey",
                            "created_utc": 1757375865,
                            "replies_count": 1
                        },
                        {
                            "id": "nd57yzo",
                            "body": "wild, is any trend over because its increasing but not pushing new ATHs? No not really. Share buybacks are never going away",
                            "score": 1,
                            "author": "PotatoTrader1",
                            "created_utc": 1757362458,
                            "replies_count": 0
                        }
                    ],
                    "selftext": "1️⃣ The chart tracks S&P 500 share buyback activity since 2000, showing buybacks exceeding $20 billion by the end of 2024.\n\n2️⃣ Buyback peaks often coincide with strong equity rallies—after the 2020 pandemic, repurchases surged, helping drive record highs.\n\n3️⃣ While buyback levels remain elevated, signs of slowing are emerging, with the chart flagging a possible “exhausted?” point.\n\n4️⃣ Large-scale repurchases signal management’s confidence in future prices and earnings, though excessive buybacks may strain balance sheet stability.\n\n5️⃣ If buybacks weaken, they could dampen equity demand and pricing. Investors should watch buyback momentum and corporate financial health closely.\n\n***Data source: S&P Dow Jones Indices, Elliott Wave International***\n\n  \nStocks worth watching lately include NVDA, AMD, AIFU, TSLA, SOUN, OPCL",
                    "permalink": "https://reddit.com/r/StockMarket/comments/1nbid66/buyback_boom_nearing_its_end/",
                    "subreddit": "StockMarket",
                    "created_utc": 1757320791,
                    "sort_method": "hot",
                    "num_comments": 24
                },
                {
                    "id": "1n9hlyx",
                    "url": "https://www.reddit.com/gallery/1n9hlyx",
                    "score": 580,
                    "title": "S&P 500 | The Buffett Indicator is at 178%",
                    "author": "meifx",
                    "comments": [
                        {
                            "id": "ncmop09",
                            "body": "Sometimes it feels like we'll never see a significant, prolonged drop ever again.",
                            "score": 461,
                            "author": "0rionis",
                            "created_utc": 1757108366,
                            "replies_count": 3
                        },
                        {
                            "id": "ncmokrq",
                            "body": "The Buffett Indicator is flawed because **it doesn't account for the increasing internationalization of the stock market**. While GDP only measures domestic economic activity, stock prices reflect the growing global reach of US companies.",
                            "score": 337,
                            "author": "PresenceOk1371",
                            "created_utc": 1757108328,
                            "replies_count": 3
                        },
                        {
                            "id": "ncn5v6u",
                            "body": "But buffet still buys and hasn't \"gone all to cash\"",
                            "score": 28,
                            "author": "Commercial_Rule_7823",
                            "created_utc": 1757114218,
                            "replies_count": 0
                        },
                        {
                            "id": "ncn4luz",
                            "body": "I’m not into astrology",
                            "score": 51,
                            "author": "C130J_Darkstar",
                            "created_utc": 1757113766,
                            "replies_count": 0
                        }
                    ],
                    "selftext": "**S&P 500 Market Cap: $54.0 Trillion**  \nU.S. GDP: $30.3 Trillion  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nThe \"Buffett Indicator\" has been above 175% since 2022, and BRK has been a net seller of stocks for three years. Here is a closer look at how Mag 7 impacts this ratio, and why it could go even higher.\n\n**Magnificent 7 | Combined Market Cap is $19.2 Trillion (35.5%)**  \n***Ticker – Market Cap – TTM Revenue – P/S***  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nNVDA, $4,058 Billion, $165 Billion (24.6x)  \nMSFT, $3,679 Billion, $281 Billion (13.1x)  \nAAPL, $3,557 Billion, $408 Billion (8.7x)  \nGOOG(L), $2,643 Billion, $371 Billion (7.1x)  \nAMZN, $2,477 Billion, $670 Billion (3.7x)  \nMETA, $1,642 Billion, $178 Billion (9.2x)  \nTSLA, $1,165 Billion, $93 Billion (12.5x)\n\n**The Other 493**\n\nMarket Cap: $34.8 Trillion  \nTTM Revenue: $15.3 Trillion  \nTTM Price to Revenue = 2.3x\n\n**Conclusion:** Dollar for dollar, Magnificent revenues are valued at 600% to 1000% of the rest of the market, reflective of their market power and growth outlook. U.S. Industrial Policy has shifted to favor the largest and most powerful corporations, as they are enlisted in the economic statecraft of the Trump Administration. Google is allowed to stay intact. Apple will get waivers. NVIDIA can sell H20s with a revenue share.\n\n**Trade Deal with China:** If the Trump administration opens up China to Mag 7 . . . ???\n\n**Military Industrial Complex:** Will Google, Meta, Amazon, etc., leverage their massive fixed cost investments in compute by working with the U.S. military?\n\nSpecial Note on Tesla: \\* All things equal, if Elon Musk maxes out his new pay package, TSLA could add another 2,100 bps to the Buffett Indicator",
                    "permalink": "https://reddit.com/r/StockMarket/comments/1n9hlyx/sp_500_the_buffett_indicator_is_at_178/",
                    "subreddit": "StockMarket",
                    "created_utc": 1757107726,
                    "sort_method": "hot",
                    "num_comments": 138
                },
                {
                    "id": "1n9ijrj",
                    "url": "https://www.reddit.com/gallery/1n9ijrj",
                    "score": 390,
                    "title": "It's time for Broadcom to replace Tesla in the Mag 7",
                    "author": "Prudent-Corgi3793",
                    "selftext": "After the most recent earnings report yesterday, including outstanding guidance, it's clear that Broadcom needs to be added to the Mag 8. Or even replace Tesla in the Mag 7.\n\nWith respect to net income (first graph), Broadcom still lags Nvidia, Apple, and the four hyperscalers. However, it generated $18.9 billion in net income last year to Tesla's $5.8 billion. While both are given rich valuations (P/E ratios of 122 and 208), Broadcom's income streams are projected to grow exponentially while Tesla's have been contracting; while Tesla is projected to turn a corner, but unlike the other Mag companies, they consistently miss on street expectations, even as these expectations constantly get guided down.\n\nAs far as price action, Tesla richly awarded its shareholders many years ago. But since being added to the S&P 500 nearly five years ago (second graph), it has severely lagged the broader index and trails all of its peers except for Amazon. Meanwhile, Broadcom has consistently rewarded its shareholders with nearly 7x returns in less than five years, handily trouncing all of the Mag 8 peers except for Nvidia.\n\nHow about for year-to-date? Again (third graph), Broadcom is the leader at +32.66% YTD. Tesla brings up the rear at -10.74%.\n\nLike Nvidia, Microsoft, Alphabet, Amazon, and Meta, Broadcom is also a high margin tech company that fits the AI theme, with Apple also now making an entry into this space. Tesla is a low-margin automotive company with a high margin energy credits division and a highly speculative robotics play.",
                    "permalink": "https://reddit.com/r/StockMarket/comments/1n9ijrj/its_time_for_broadcom_to_replace_tesla_in_the_mag/",
                    "subreddit": "StockMarket",
                    "created_utc": 1757110054,
                    "sort_method": "hot",
                    "num_comments": 44
                },
                {
                    "id": "1naxak3",
                    "url": "https://i.redd.it/t6to19wsornf1.jpeg",
                    "score": 45,
                    "title": "Week Recap: The stock market closed higher. Labor market grow slow. A rate cut is almost certain, but recession concerns are rising. September 1, 2025 – September 5, 2025",
                    "author": "vjectsport",
                    "selftext": "First of all, I don't want to be misunderstood. This heat map is weekly that it visualized via closing prices from August 29 to September 5.\n\nTariff uncertainty and Trump's attacks on Powell is our regular agenda. In addition, we will hear to more recession concerns again due to labor market grow slow.\n\n📊 Here are the S&P 500's week-by-week results for the last 4 week,\n\nAugust 8 close at 6,389.45 - August 15 close at 6,449.79 🟢 (0.94%)\n\nAugust 15 close at 6,449.79 - August 22 close at 6,466.91 🟢 (0.27%)\n\nAugust 22 close at 6,466.91 - August 29 close at 6,460.27 🔴 (-0.10%)\n\nAugust 29 close at 6,460.27 - September 5 close at 6,481.52 🟢 (+0.33%)\n\n🔸 Monday: Holiday.\n\n🔸 Tuesday: After the 3-day holiday, the stock market damaged as U.S. had to refund tariff money and opened lower than 1%. 30-Year Treasury Yield hit 5% again. Trump said that stock markets down today because it needs the tariffs. The stock market closed lower and September started with losing. 🔴\n\n🔸 Wednesday: Fed meeting is approaching and Fed's Waller said we should cut at next meeting. Trump said need an early decision from supreme court on tariffs and stock market goes down because of uncertainty. The stock market opened higher. Google avoids worst-case penalties in antitrust case and the stock jumped more than 8%. This lifted the market. Nasdaq gained nearly 1% and the stock market closed higher. 🟢\n\n🔸 Thursday: Before the session, ADP Employment Changes came in below expectations, but it is still positive. Continuing Jobless Claims came at 1,940K. I think, it's good sign below 2,000K because Fed will start rate cut, but it should be from inflation. Labor market grow slow. The stock market opened slightly higher. The session was quiet, but S&P 500 closed a new all-time high at 6,502.08. 🟢\n\n🔸 Friday: Before the session, Nonfarm Payrolls came in below expectations, but it's positive like ADP Employment Changes. U.S. added 22,000 Jobs in August. The stock market opened higher, but high volatility was here. Trump continued to attack Powell and said that as usual, he's to late. The stock market lost gains and closed lower. 🔴\n\nRate cut in September is almost certain. Moreover, the probability of 25 point rate cut is 89% and the probability of 50 point rate cut is 11% in CME FedWatch Tool. The are three more meetings left until end of the year and all of them expecting rate cut. However, a new concern is arrived again. The Core PCE inflation is steady at around 2.9%. If Fed cuts interest rate due to job market, recession fears could come with selling. We don't need to panic for now, but this risk must keep in mind.\n\nWhat do you think? What do you think? How was your week?\n\n❓ Note: Many people have asked where screenshots come from in my previous posts. I'm using Stock+ on iPhone and iPad. You can find it on the App Store. If you're using Android, I'm now sure if it's available, but you can try searching \"Stock Map\" or \"Heat Map\". ",
                    "permalink": "https://reddit.com/r/StockMarket/comments/1naxak3/week_recap_the_stock_market_closed_higher_labor/",
                    "subreddit": "StockMarket",
                    "created_utc": 1757261555,
                    "sort_method": "hot",
                    "num_comments": 48
                },
                {
                    "id": "1n7y8iq",
                    "url": "https://www.reddit.com/r/StockMarket/comments/1n7y8iq/heres_5_value_plays_trading_at_multiyear_pe_lows/",
                    "score": 84,
                    "title": "Here's 5 value plays trading at multi-year PE lows",
                    "author": "TestWorth9634",
                    "selftext": "**1. Lululemon | $LULU**\n\n$LULU currently trades at 13.8x NTM PE. If they hit analyst estimates at $15.6 in FY27 with a PE of +20x (still below historic levels), then $LULU is a $312 stock.\n\n**2. Novo Nordisk | $NVO**\n\n$NVO has had a difficult year but they have a very strong presence in the diabetes and weight loss industries. They're also investing heavily into growth in Denmark, France, and NC to ride the growing obesity market wave.\n\nCurrently trading at 14.6x PE whilst historically trading around double that. $113 would be a 100% move.\n\n**3. Regeneron Pharmaceuticals | $REGN**\n\n$REGN is a slightly higher growth value play with a current NTM PE in the 14x range whilst historically trading for +20x PE. P/B is also at 2.0x (historically +4.0x).\n\nWith minimal debt and a current ratio above 7.0x, they're quite a safe play in a period of macro weakness. Their portfolio includes eye diseases (EYLEA), chronic inflammation (Dupixent), and cancers (Libtayo) which will all necessary despite economic conditions.\n\nI like $REGN a lot - it's on my watchlist.\n\n**4. Constellation Brands | $STZ**\n\nA recent Buffett addition to his portfolio in Q2 - $STZ currently trades at a 11.9x PE and a 10.5x EBITDA multiple with a 2.5% dividend yield. The alcohol industry tends to be more resilient in downturns than most industries.\n\nIf $STZ can return to historic PE multiples in the +15x range then they should be trading at $204 given a $13.6 EPS (as per analyst estimates in FY26/27).\n\n**5. Merck & Co | $MRK**\n\n$MRK is currently trading at a NTM PE of 9.3x , which is very low historically and also lower than the broader healthcare sector.\n\nFCF has been steady and has generally traded upwards over the last few quarters reaching $1.68 per share in Q2. If $MRK can generate $9.61 in EPS in FY26 (in line with analyst estimates), and we apply a conservative 12x multiple then $MRK should be a $115 stock.\n\nDefinitely a nice defensive play and an under the radar healthcare stock at the moment.\n\nMore Stocks to watch: $TSLA $UNH $NKE $BABA $BGM $FIG",
                    "permalink": "https://reddit.com/r/StockMarket/comments/1n7y8iq/heres_5_value_plays_trading_at_multiyear_pe_lows/",
                    "subreddit": "StockMarket",
                    "created_utc": 1756952639,
                    "sort_method": "hot",
                    "num_comments": 46
                },
                {
                    "id": "1n6kv4b",
                    "url": "https://www.reddit.com/r/StockMarket/comments/1n6kv4b/schwab_stocks_fall_yields_vix_soar_after_tariff/",
                    "score": 16,
                    "title": "SCHWAB: Stocks Fall, Yields & VIX Soar After Tariff Ruling\n09:26am EDT, 09/02/2025",
                    "author": "themuleskinner",
                    "selftext": "**(Tuesday market open)** Treasury yields and volatility spiked while tech stocks slumped to start the short week after a court decision ruled most of President Trump's tariffs illegal. The tariffs remain in place on appeal, but the news has markets on edge, judging by global yield climbs. Seasonal trends also came into play, with September traditionally Wall Street's worst month and a strong earnings season virtually over.\n\n**Salesforce** (CRM) and **Broadcom** (AVGO) earnings tomorrow and Thursday keep tech in view as the sector appeared to stumble. Broadcom might shed more light on AI demand after results from **Dell** (DELL) and **Marvell** (MRVL) last week triggered anxiety. Industry leader Nvidia (NVDA) fell more than 3% Friday and is down again this morning, hurt partly by those two earnings reports and by a *Wall Street Journal* article about a new AI chip developed by Chinese firm **Alibaba** (BABA). Some of today's shakiness also could reflect trepidation approaching Friday's August **nonfarm payrolls** report. Analysts expect more weakness with just 78,000 jobs added. Data today include a look at U.S. manufacturing health.\n\nMajor indexes retreated from recent record highs last Friday as **Personal Consumption Expenditures** (PCE) price data reinforced ideas that inflation remains sticky. Odds of a rate cut this month remain above 90%, according to the **CME FedWatch Tool**. \"We expect the Fed to cut twice this year,\" said Cooper Howard, director, fixed income strategy at the Schwab Center for Financial Research. Risk-off trading dominated late last week with energy, consumer staples, and health care among the leaders and info tech and consumer discretionary weaker. Still, August was the fourth straight positive month for the **S&P 500 index**, which rose 1.91%. The Nasdaq added 1.58%.\n\n**Three things to watch**\n\n**Software earnings hint at rebound with Salesforce ahead:** Investors will closely watch a slate of software companies set to report earnings this week after better-than-expected results from **Snowflake** (SNOW) and other industry firms last week defied a broader slump in the sector. Snowflake and **MongoDB** (MDB) both spiked after reporting solid revenue growth. **MongoDB** said it's added more than 5,000 customers year to date, a record amid growing demand from large firms building AI applications. Results clashed with a trend of underperformance in the software sector. Shares of giants like **Salesforce** (CRM) and **Adobe** (ADBE) have dropped significantly in 2025, even with the **Nasdaq Composite** up more than 10%. Shares of giants like **Salesforce** (CRM) and **Adobe** (ADBE) have dropped significantly in 2025, even with the **Nasdaq Composite** up more than 10%. This week, investors get more insight from software leaders, headlined by **Salesforce** on Wednesday. **Broadcom** (AVGO), which derives nearly half its revenue from software sales, will report Thursday.\n\nCongress back in town with a deadline: Senators and representatives return to Washington today following a summer break. The top priority will be government funding, which expires September 30. Legislators will need to pass the 12 appropriations bills that fund every government agency and program by then. \"Congress is no where near doing that, and that means there is a risk of a government shutdown at the end of September,” said Michael Townsend, managing director of legislative and regulatory affairs at Schwab. \"Historically, government shutdowns have not been big market movers, in fact, the market has gone up in the last five government shutdowns. But it would add yet another element of uncertainty that markets will have to consider.\" Under a nearer-term Washington microscope: This week's **Senate Banking Committee** confirmation hearing for Stephen Miran, Trump's nominee to fill a Fed vacancy. This could bring more drama than usual after Trump attempted for fire Fed Governor Lisa Cook last week, raising concerns about Fed independence.\n\n**Positive trend persists despite today's weakness: Technically**, markets held up relatively well last week and the momentum-signaling **Relative Strength Index (RSI)** for the **S&P 500 index** finished Friday above 58, a constructive reading, though down a bit from the August peak near 68. Breadth remained constructive last week, as well, but volatility as measured by the **Cboe Volatility Index** (VIX) spiked today, interrupting what had been a subdued hedging environment. So-called \"risk-on\" sectors led in August with strong showings from communication services, materials, financials, and consumer discretionary stocks. Info tech had a mild month, rising less than 0.3%. And the **S&P 500 Equal Weight Index** (SPXEW), which weighs all stocks the same rather than by market capitalization, outpaced the **S&P 500 index** for the first time in four months, a sign of broader strength beyond the mega caps.\n\n**On the move**\n\n* Tech leaders **Nvidia** (NVDA) and **Palantir** (PLTR) fell early Tuesday amid a general pullback in risk-on trading that appeared to spill over from Friday. Nvidia tumbled 2.4% and is now down nearly 8% from recent all-time highs recorded before last week's earnings report, which came in generally as expected but didn't set off any fireworks. Palantir fell 3.5% this morning and is down almost 18% from last month's peak.  \n* **Bitcoin futures** (/BTC) dropped nearly 4% Friday and ended August down 7.6% for the month despite hitting an all-time high on August 14. Futures rebounded slightly early today. **Coinbase** (COIN) both dropped 1% Friday but **Circle Internet Group** (CRCL) managed a light gain.  \n* **Signet Jewelers** (SIG) shares shined today, up 3.4% as investors reacted to solid earnings. The company also raised earnings guidance for the fiscal year.  \n* **Meta Platforms** (META) fell 1.7% after Reuters reported the company removed several celebrity AI chatbots after using celebrity voices and images without permission.  \n* **Block** (XYZ) fell 3.1% as BNP Paribas downgraded shares to Hold from Buy.  \n* **Tesla** (TSLA) fell 2% ahead of the open after a 4% drop in August sales in China, Reuters reported.  \n* **PepsiCo** (PEP) popped nearly 5% today as the *Wall Street Journal* reported that activist investor Elliott Investment Management has built a roughly $4 billion stake in the company.  \n* **Newmont** (NMT) climbed 1% early Tuesday, helped by global uncertainty and rate cut hopes that continue to support gold prices.  \n* **Crude oil** rose 2.3% early Tuesday amid increased concerns around the war in Ukraine and ahead of this coming weekend's OPEC meeting. Analysts expect no production changes from the meeting, CNBC reported.  \n* **Marvell Technology** plunged double digits Friday and another 2.6% today after second quarter data center revenue rose 69% but missed analysts' consensus. Earnings per share and revenue were in line with expectations, and guidance also was near consensus views. Shares had already fallen 30% this year before the latest drop.  \n* **Dell Technologies** dropped nearly 9% Friday despite quarterly results that topped Wall Street's estimates and reflected strong growth in its AI server business. It also raised its full-year outlook. But guidance for third quarter earnings per share fell short of consensus.  \n* The **Russell 2000\\*\\*\\*\\*****^(®)** **Index** (RUT) of smaller stocks outpaced other major indexes with a nearly 7% rise in August as rate cut odds supported a move into smaller names.\n\n",
                    "permalink": "https://reddit.com/r/StockMarket/comments/1n6kv4b/schwab_stocks_fall_yields_vix_soar_after_tariff/",
                    "subreddit": "StockMarket",
                    "created_utc": 1756822986,
                    "sort_method": "hot",
                    "num_comments": 2
                },
                {
                    "id": "1n5w841",
                    "url": "https://i.redd.it/czcjtqoa4lmf1.png",
                    "score": 26,
                    "title": "NVDA | NVIDIA Last 5 Years + Next 5 Years",
                    "author": "meifx",
                    "selftext": "NVIDIA CEO Jen-Hsun Huang lays it out clearly in his conference call remarks. Based on his comments, I expect the company to generate 40% to 50% revenue growth for the next few years. Beyond GPU and Networking Silicon, in the future, I believe NVIDIA will enter A.I. software infrastructure services, offering full system and application support for the largest compute customers in the world, both CSP and Enterprise, as well as Sovereign investors.\\* (see below)\n\nI am long NVDA and AMD.\n\n**Key Nuggets from CEO in Last 3 Conference Calls:**\n\n**FQ4 2025 (Feb. 26, 2025):**\n\n\"There are now multiple scaling laws. There is the **pre-training scaling law**, and that is going to continue to scale because we have multimodality, we have data that came from reasoning that are now used to do pretraining. And then the second is **post-training scaling law**, using reinforcement learning human feedback, reinforcement learning AI feedback, reinforcement learning, verifiable rewards. The amount of computation you use for post training is actually higher than pretraining. And it is kind of sensible in the sense that you could, while you are using reinforcement learning, generate an enormous amount of synthetic data or synthetically generated tokens. AI models are basically generating tokens to train AI models. And that's post training. And the third part, this is the part that you mentioned is **test time computation or reasoning, long thinking, inference scaling**. They are all basically the same ideas. And there you have a chain of thought, you have searched. The amount of tokens generated and the amount of inference compute needed is already 100x more than the one-shot examples and the one-shot capabilities of large language models in the beginning. And that is just the beginning. This is just the beginning. The idea that the next generation could have thousands of times and even hopefully, extremely thoughtful and simulation-based and search-based models that could be hundreds of thousands, millions of times more compute than today is in our future.\"\n\n**FQ1 2026 (May 28, 2025):**\n\n**\"Grace Blackwell NVLink72 is the ideal engine today, the ideal computer thinking machine, if you will, for reasoning AI. There's a couple of reasons for that. The first reason is that the token generation amount, the number of tokens reasoning goes through, is 100 times, 1,000 times more than a one-shot chatbot. It's essentially thinking to itself, breaking down a problem step-by-step. It might be planning multiple paths to an answer. It could be using tools, reading PDFs, reading web pages, watching videos, and then producing a result, an answer. The longer it thinks,** **the better the answer**, **the smarter the answer is**. And so, what we would like to do, and the reason why Grace Blackwell was designed to give such a giant step-up in inference performance, is so that you could do all this and still get a response as quickly as possible. **Compared to Hopper, Grace Blackwell is some 40 times higher speed and throughput compared.** And so, this is going to be a huge, huge benefit in driving down the cost while improving the quality of response with excellent quality of service at the same time. So, that's the fundamental reason. That was the core driving reason for Grace Blackwell NVLink72. Of course, in order to do that, we had to reinvent, literally redesign the entire way that these supercomputers are built, and -- but now we're in full production. It's going to be exciting. It's going to be incredibly exciting.\"\n\n**FQ2 2025 (August 27, 2025):**\n\n\"And so we are really an AI infrastructure company, and we are hoping to continue to contribute to growing this industry, making AI more useful and then very importantly, driving the performance per watt because the world, as you mentioned, limiters, it will always likely be power limitations or AI -- building limitations. And so we need to squeeze as much out of that factory as possible. **NVIDIA's performance per unit of energy used drives the revenue growth of that factory.** It directly translates. If you have a 100- megawatt factory, performance per 100 megawatt drives your revenues. It is tokens per 100 megawatts of factory. In our case also, the performance per dollar spent is so high that your gross margins are also the best. But anyhow, these are the limiters going forward and $3 trillion to $4 trillion is fairly sensible for the next 5 years.\"\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n\\* Note: NVIDIA has a huge opportunity in the Middle East as oil resource rich nations looks to convert their geological wealth endowment (oil) into energy to fuel massive data center investments which produce revenue. Insane geopolitical, economic transformation lever.\n\n**Sovereign A.I. + A.I. Factory Infrastructure:** Stargate alone could add **$100 billion** in revenue to NVIDIA over the next few years. Saudi Arabia: 500 MW project could result in demand for 300,000 NVIDIA GPUs, valued at approximately **$10 billion**. The UAE 5 GW project could result in demand for 3 million NVIDIA GPUs, valued at approximately **$90 billion**.",
                    "permalink": "https://reddit.com/r/StockMarket/comments/1n5w841/nvda_nvidia_last_5_years_next_5_years/",
                    "subreddit": "StockMarket",
                    "created_utc": 1756750428,
                    "sort_method": "hot",
                    "num_comments": 0
                }
            ],
            "fetched_at": "2025-09-27T15:45:53.376Z"
        },
        "wallstreetbets": {
            "count": 10,
            "posts": [
                {
                    "id": "1nqgjjn",
                    "url": "https://i.redd.it/78ml5s4x6drf1.jpeg",
                    "score": 19,
                    "title": "TSLA gains",
                    "author": "Mountain-Raise7012",
                    "comments": [
                        {
                            "id": "ng6mqyk",
                            "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 3 | **First Seen In WSB** | 1 year ago\n**Total Comments** | 23 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](https://discord.gg/wsbverse) | [**⚔**](https://www.reddit.com/r/KarmaCave/)",
                            "score": 1,
                            "author": "VisualMod",
                            "created_utc": 1758829446,
                            "replies_count": 0
                        },
                        {
                            "id": "ng6r6g3",
                            "body": "What broker do you use?",
                            "score": 1,
                            "author": "Sunchi_Adventures",
                            "created_utc": 1758830744,
                            "replies_count": 2
                        },
                        {
                            "id": "ng6oyf8",
                            "body": "I want to get into investing.. but I have no idea what I’m even looking at.",
                            "score": 1,
                            "author": "KyleKaoKen",
                            "created_utc": 1758830101,
                            "replies_count": 1
                        },
                        {
                            "id": "ng6r7od",
                            "body": "Nice hit, many have been punished shorting Tesla recently",
                            "score": 0,
                            "author": "Perry-Boy740",
                            "created_utc": 1758830753,
                            "replies_count": 0
                        }
                    ],
                    "selftext": "",
                    "permalink": "https://reddit.com/r/wallstreetbets/comments/1nqgjjn/tsla_gains/",
                    "subreddit": "wallstreetbets",
                    "created_utc": 1758829434,
                    "sort_method": "hot",
                    "num_comments": 8
                },
                {
                    "id": "1nq8r29",
                    "url": "https://www.reddit.com/gallery/1nq8r29",
                    "score": 156,
                    "title": "Tsla made my day, did YOLO put on it yesterday 🙌",
                    "author": "imsuffi",
                    "comments": [
                        {
                            "id": "ng4wov4",
                            "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 9 | **First Seen In WSB** | 1 year ago\n**Total Comments** | 18 | **Previous Best DD** | \n**Account Age** | 1 year | | \n\n[**Join WSB Discord**](https://discord.gg/wsbverse) | [**⚔**](https://www.reddit.com/r/KarmaCave/)",
                            "score": 1,
                            "author": "VisualMod",
                            "created_utc": 1758811639,
                            "replies_count": 0
                        },
                        {
                            "id": "ng4y3fz",
                            "body": "How long did you keep your butt cheeks clinched tight.",
                            "score": 36,
                            "author": "TheGeneralNation",
                            "created_utc": 1758812037,
                            "replies_count": 1
                        },
                        {
                            "id": "ng5026b",
                            "body": "And you didn’t tell me any of this before hand thanks",
                            "score": 10,
                            "author": "DiamondDouble8855",
                            "created_utc": 1758812593,
                            "replies_count": 1
                        },
                        {
                            "id": "ng4xo6n",
                            "body": "Nice work. In a price discovery environment, took some balls",
                            "score": 3,
                            "author": "optionsCone",
                            "created_utc": 1758811918,
                            "replies_count": 0
                        },
                        {
                            "id": "ng6i00t",
                            "body": "Just remember OP, you only YOLO once.",
                            "score": 3,
                            "author": "LazloHollifeld",
                            "created_utc": 1758828029,
                            "replies_count": 1
                        }
                    ],
                    "selftext": "So far had a great week with multiple wins!",
                    "permalink": "https://reddit.com/r/wallstreetbets/comments/1nq8r29/tsla_made_my_day_did_yolo_put_on_it_yesterday/",
                    "subreddit": "wallstreetbets",
                    "created_utc": 1758811627,
                    "sort_method": "hot",
                    "num_comments": 29
                },
                {
                    "id": "1nqa77b",
                    "url": "https://i.redd.it/4odfp0aezbrf1.png",
                    "score": 11,
                    "title": "Made a nice move on TSLA, thanks for the 10 bands Elmo!",
                    "author": "Ryu6912",
                    "comments": [
                        {
                            "id": "ng58bey",
                            "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 8 | **First Seen In WSB** | 4 years ago\n**Total Comments** | 1448 | **Previous Best DD** | \n**Account Age** | 14 years | | \n\n[**Join WSB Discord**](https://discord.gg/wsbverse) | [**⚔**](https://www.reddit.com/r/KarmaCave/)",
                            "score": 1,
                            "author": "VisualMod",
                            "created_utc": 1758814954,
                            "replies_count": 0
                        },
                        {
                            "id": "ng59kmh",
                            "body": "When do we get a LDI pop?? 🤑🤑",
                            "score": 1,
                            "author": "Rare-Kangaroo8075",
                            "created_utc": 1758815309,
                            "replies_count": 0
                        },
                        {
                            "id": "ng5fzl9",
                            "body": "https://preview.redd.it/s8j7dho96crf1.jpeg?width=1320&format=pjpg&auto=webp&s=23281d8209bf71514d42c5f8b4c5623c91c81ecf\n\n11 bands here 🙏",
                            "score": 1,
                            "author": "Beneficial-Ad-7771",
                            "created_utc": 1758817133,
                            "replies_count": 1
                        }
                    ],
                    "selftext": "",
                    "permalink": "https://reddit.com/r/wallstreetbets/comments/1nqa77b/made_a_nice_move_on_tsla_thanks_for_the_10_bands/",
                    "subreddit": "wallstreetbets",
                    "created_utc": 1758814946,
                    "sort_method": "hot",
                    "num_comments": 5
                },
                {
                    "id": "1nl5id3",
                    "url": "https://www.reddit.com/gallery/1nl5id3",
                    "score": 45,
                    "title": "Thanks $Tsla",
                    "author": "imsuffi",
                    "comments": [
                        {
                            "id": "nf2vbkh",
                            "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 7 | **First Seen In WSB** | 1 year ago\n**Total Comments** | 18 | **Previous Best DD** | \n**Account Age** | 1 year | | \n\n[**Join WSB Discord**](https://discord.gg/wsbverse) | [**⚔**](https://www.reddit.com/r/KarmaCave/)",
                            "score": 1,
                            "author": "VisualMod",
                            "created_utc": 1758293097,
                            "replies_count": 0
                        },
                        {
                            "id": "nf5d5z3",
                            "body": "Shareholders meeting in nov votes are huge\nNever bet against elon",
                            "score": 1,
                            "author": "nzproduce",
                            "created_utc": 1758319764,
                            "replies_count": 0
                        }
                    ],
                    "selftext": "",
                    "permalink": "https://reddit.com/r/wallstreetbets/comments/1nl5id3/thanks_tsla/",
                    "subreddit": "wallstreetbets",
                    "created_utc": 1758293094,
                    "sort_method": "hot",
                    "num_comments": 5
                },
                {
                    "id": "1nrgexm",
                    "url": "https://www.reddit.com/gallery/1nrgexm",
                    "score": 44,
                    "title": "We're so back",
                    "author": "SuddenGrade9632",
                    "comments": [
                        {
                            "id": "nge86ma",
                            "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 8 hours ago\n**Total Comments** | 3 | **Previous Best DD** | \n**Account Age** | 1 year | | \n\n[**Join WSB Discord**](https://discord.gg/wsbverse) | [**⚔**](https://www.reddit.com/r/KarmaCave/)",
                            "score": 1,
                            "author": "VisualMod",
                            "created_utc": 1758929836,
                            "replies_count": 0
                        },
                        {
                            "id": "ngeb6dk",
                            "body": "Holy shit, you are fucked.",
                            "score": 15,
                            "author": "Apprehensive_Help_34",
                            "created_utc": 1758930913,
                            "replies_count": 1
                        },
                        {
                            "id": "nge8t43",
                            "body": "Who’s we",
                            "score": 9,
                            "author": "SadJapaneseTitan",
                            "created_utc": 1758930056,
                            "replies_count": 1
                        },
                        {
                            "id": "ngebpmm",
                            "body": "You and who?",
                            "score": 5,
                            "author": "WaterAdventurous6718",
                            "created_utc": 1758931112,
                            "replies_count": 1
                        },
                        {
                            "id": "ngebtqh",
                            "body": "i haven’t been following that stock that you sold 5k shares of for awhile.  anything in particular make you sell off like that?",
                            "score": 3,
                            "author": "blitzkregiel",
                            "created_utc": 1758931155,
                            "replies_count": 1
                        },
                        {
                            "id": "ngec0fx",
                            "body": "What’s PLTR doing rn? Ik they got a contract but I feel like I’m missing something",
                            "score": 2,
                            "author": "TheRealJFD",
                            "created_utc": 1758931225,
                            "replies_count": 1
                        },
                        {
                            "id": "ngeoei6",
                            "body": "Did you keep doing the same thing until you got different results?",
                            "score": 2,
                            "author": "TopTheory1170",
                            "created_utc": 1758935922,
                            "replies_count": 0
                        },
                        {
                            "id": "ngetx6r",
                            "body": "Wait your color is green? Why is mine always red?",
                            "score": 2,
                            "author": "SetoXlll",
                            "created_utc": 1758938044,
                            "replies_count": 0
                        }
                    ],
                    "selftext": "Palantir and Tesla carried",
                    "permalink": "https://reddit.com/r/wallstreetbets/comments/1nrgexm/were_so_back/",
                    "subreddit": "wallstreetbets",
                    "created_utc": 1758929826,
                    "sort_method": "hot",
                    "num_comments": 24
                },
                {
                    "id": "1npmd2r",
                    "url": "https://www.reddit.com/gallery/1npmd2r",
                    "score": 352,
                    "title": "YOLO: Loaded the Boat on Tesla Puts 🚀📉",
                    "author": "Lxs_Fuentes",
                    "selftext": "Boys, I went full ape on $TSLA puts. 💎🙌\n\nCurrently sitting on $390 strike 11/21 puts with enough contracts to make or break my entire existence. Average cost was higher, but I averaged down with more today at $17.80.\n\nThis stock has been pumping harder than Elon at an earnings call, but every rocket runs out of fuel. Earnings + macro + overextension = setup for a rug pull.\n\nIf Tesla slides under $400, I print. If it nukes back to $372–$361 breakeven, I’m sure retiring with my tendies.\n\nIf not? Well, I’ll be the next WSB legend who donated $100k+ to this casino. 🎰\n\nScreenshots for proof (because otherwise it didn’t happen).\n\nSend thoughts, prayers, memes, and crayons.\n\nYOLO.\n",
                    "permalink": "https://reddit.com/r/wallstreetbets/comments/1npmd2r/yolo_loaded_the_boat_on_tesla_puts/",
                    "subreddit": "wallstreetbets",
                    "created_utc": 1758744008,
                    "sort_method": "hot",
                    "num_comments": 204
                },
                {
                    "id": "1npuq2p",
                    "url": "https://i.redd.it/453awq80y7rf1.jpeg",
                    "score": 17,
                    "title": "Tesla Gain",
                    "author": "ManOnTheMoon1963",
                    "selftext": "Sold this a couple weeks ago. Definitely missed out on some upside but it’s whatever. Time to find the next regarded move ",
                    "permalink": "https://reddit.com/r/wallstreetbets/comments/1npuq2p/tesla_gain/",
                    "subreddit": "wallstreetbets",
                    "created_utc": 1758765902,
                    "sort_method": "hot",
                    "num_comments": 15
                },
                {
                    "id": "1nqvs5j",
                    "url": "https://www.reddit.com/gallery/1nqvs5j",
                    "score": 201,
                    "title": "It’s possible boys.. -11k to +8k.",
                    "author": "Zestyclose_Put3445",
                    "selftext": "Never ever thought I’d make back the money. Spent 4 years losing everyday in silence till I had enough and started to take ts seriously. Everything made back in 6 months.. wow",
                    "permalink": "https://reddit.com/r/wallstreetbets/comments/1nqvs5j/its_possible_boys_11k_to_8k/",
                    "subreddit": "wallstreetbets",
                    "created_utc": 1758874857,
                    "sort_method": "hot",
                    "num_comments": 19
                },
                {
                    "id": "1nnxkam",
                    "url": "https://www.reddit.com/gallery/1nnxkam",
                    "score": 386,
                    "title": "I overcame my degeneracy",
                    "author": "Jpow2024",
                    "selftext": "A month ago, I posted that I had lost 20k on 0DTE NVDA/TSLA calls and y'all roasted me. I thought the first one was free, but it wasn't.\n\nSo I considered the 20k to be tuition and a month later I somehow dug myself out of the grave.\n\nNow I'm loaded up on AMZN 230c expiring 10/10\n\n",
                    "permalink": "https://reddit.com/r/wallstreetbets/comments/1nnxkam/i_overcame_my_degeneracy/",
                    "subreddit": "wallstreetbets",
                    "created_utc": 1758572752,
                    "sort_method": "hot",
                    "num_comments": 69
                },
                {
                    "id": "1noayk3",
                    "url": "https://i.redd.it/t4ce1sqf9vqf1.png",
                    "score": 22,
                    "title": "WeRide the Pony AIxpress - $11k in Chinese Robotaxi OTM calls",
                    "author": "InternetIsForPrawn",
                    "selftext": "I have about $11k in options spread across $PONY and $WRD. 10/17 25c and 30c for Pony and 10/17 17.50c for Wedrive.\n\nDownside risk: far otm, expiry looms, ARKQ bought some Pony on Monday...\n\nUpside: market is frothy and risk-on sentiment still seems to be the narrative, Chinese stocks still running strong, Robotaxi and AI news still causing random pumps. Hoping pony can hit $25 in the next couple weeks and Wedrive has a sympathy pump as a result. Will probably instead wish I just bought TSLA 500c",
                    "permalink": "https://reddit.com/r/wallstreetbets/comments/1noayk3/weride_the_pony_aixpress_11k_in_chinese_robotaxi/",
                    "subreddit": "wallstreetbets",
                    "created_utc": 1758612357,
                    "sort_method": "hot",
                    "num_comments": 5
                }
            ],
            "fetched_at": "2025-09-27T15:45:58.597Z"
        }
    }
}